[{"title": "How Could FirstNet Have Helped in the Boston Marathon Bombing?", "url": "http://www.govtech.com/public-safety/How-Could-FirstNet-Have-Helped-in-the-Boston-Marathon-Bombing.html", "author": "-", "content": "April 23, 2013 By Rachelle Chong\nDuring the FirstNet board meeting held April 23 in Washington, D.C., the Boston Marathon bombing was raised and how this future public safety broadband network might have helped in this type of terrorist bombing situation.\nFirstNet Board Chairman Sam Ginn felt that “Congress got it right” because FirstNet will build state-of-the-art LTE infrastructure that will allow downloads of video transmission, uploading of camera images and photos of persons to be swiftly disseminated to law enforcement across jurisdictions.\nBoard member Charles “Chuck” Dowd, deputy chief of the New York City Policy Department, gave a further example of bomb squads from various jurisdictions pooling their expertise and working together using real-time, high-definition video to help the local bomb squad deal with a particular device.\nBoard member Kevin McGinnis, chief/CEO of North East Mobile Health Services, gave a final example that he can monitor the vital signs of 20 bombing victim patients on his smartphone, but that doesn’t work unless he has a robust broadband system and the smartphones for his emergency medical service professionals.\nAuthorized by Congress last year, FirstNet will provide emergency responders with the first high-speed, nationwide network dedicated to public safety. The broadband data network will be built using LTE, the most advanced wireless technology available at present. Overseen by representatives of public safety, government and the wireless industry, FirstNet is an independent entity within the U.S. Department of Commerce, National Telecommunications and Information Administration.", "date": "Tue, 23 Apr 2013 00:00:00 GMT", "id": "4464"}, {"title": "Djokovic beats Nadal to win Monte Carlo Masters", "url": "http://www.knoe.com/story/22035172/djokovic-beats-nadal-to-win-monte-carlo-masters", "author": "Jerome Pugmireap", "content": "", "date": "-", "id": "5232"}, {"title": "Why Would Chechens Want to Bomb Boston?", "url": "http://abcnews.go.com/US/chechens-violent-history-includes-black-widows-attacks-school/story?id=18997035", "author": "ABC News", "content": "The two brothers suspected in the Boston Marathon bombings are of Chechen ethnicity, officials said today, identifying them with a group that has a long history of violence against Russia and ties to Muslim extremists groups.\n Both Dzhokhar Tsarnaev 19, and his brother Tamerlan Tsarnaecv, 26, who was killed overnight by gunfire, were born in Kyrgystan, the brothers' uncle told reporters today. The brothers' father is currently living in the semi-autonomous Russian province of Dagestan, which is adjacent to Chechnya.\n The entire region has been roiled by ethnic tensions, Islamic militants and corruption.\n The history of Chechens may -- or may not -- shed light on the men's lives in America or their motivation for the bombings.\n Watch Live Coverage of the Manhunt for the Boston Marathon Bombers on ABC News\n  Read ABC News' full coverage of the Boston Marathon Bombers Manhunt\n Who are the Chechens?\n Chechens are an ethnic group hailing from the southern edge of the Russian border, known as the North Caucasus region, whose history has been marked by its violent struggles for independence.\n After the fall of the Soviet Union, Chechens launched two significant campaigns for independence, leading to the First Chechen War in 1994 (a year after the younger suspect was born) and the Second Chechen War in 1999, which has led to ongoing violence in the region.\n Brothers Suspected in Boston Bombings Watch Video\n Authorities Investigate Bombing Suspects' Global Connections Watch Video\n Marathon Bombing Suspects' Uncle: 'We Are Ashamed' Watch Video\n Could this attack have something to do with those wars?\n Maybe, according to Christopher Swift, a professor of National Security at Georgetown University, who said the second Chechen war has morphed into a \"radical\" and \"virulent\" war that has incorporated elements of the Muslim idea of jihad.\n \"That war initially began as a nationalist war, much like the first one, but very, very quickly metastasized into something that looks much more like the radical Salafi-Jihadi movements we've seen in other regions around the world,\" Swift said.\n \"The movement that's emerged from the 15 years of war is very radical, it's very virulent, it's very nasty, but up until now, it's also been very, very local. Their ideology and rhetoric talks about fighting jihad against the West, but their operations have always been in Russia itself and predominately within the republics of Chechnya, Dagestan, and Ingushetia,\" he said.\n \"So the bombing in Boston at the Boston Marathon, doesn't really seem to comport with the operations we've seen from of this region in the past, but it does comport with the self-radicalizing ideology,\" he said.\n What connection do Chechens have to Islam?\n The majority of Chechens are Muslims, and the Council on Foreign Relations say that there are several ties between Chechen militants and Al Qaeda, noting that the U.S. has publicly said that Osama bin Laden had \"fueled the flames in Chechnya.\"\n The State Department has identified Al Qaeda financiers who also finance Chechen rebels, according to the CFR. The most prominent of these groups is the Islamic International Peacekeeping Brigade.\n A terror group in Chechnya has also identified itself with Muslim extremists, calling itself the Special Purpose Islamic Regiment, recognized by the U.S. State Department as a terrorist group.\n The Central Asia-Caucasus Institute has said that ideas of jihad and an Islamic state spread among Chechen people as they fanned out across the Middle East following the Second Chechen War.\nHave Chechen groups launched terror attacks before?\n The Chechens have claimed responsibility for a number of major terror attacks on Russia in the past 10 years, including a 2004 attack on a Russian school in which more than 350 people, many of them children, were killed.\n In addition to bombing shopping plazas, apartment buildings, parades, and trains over the years, Chechens launched an attack on a theater in Moscow in 2002 in which they held more than 700 audience members hostage. Russian forces used gas to try and sedate the Chechens, but ended up killing many of the hostages and militants.\nFederal Bureau of Investigation/AP\nThis Federal Bureau of Investigation shows a... View Full Size\n Brothers Suspected in Boston Bombings Watch Video\n Authorities Investigate Bombing Suspects' Global Connections Watch Video\n Marathon Bombing Suspects' Uncle: 'We Are Ashamed' Watch Video\n Many of the Chechen terrorists involved were women whose militant husbands had been killed by Russian forces, earning them the moniker Black Widows.\n The Black Widows became known as a deadly part of the Chechen terror groups, willing to sacrifice themselves as suicide bombers for the Chechen cause.\n In 2010, Chechen militants claimed responsibility for the bombing of two metro stations in Moscow, killing nearly 40 people.\n What does Dagestan have to do with this?\n Dagestan is also a region on the Russian border, part of North Caucasus, and shared a border with Chechnya. Though Dagestan did not fight against Russia for independence after the fall of the Soviet Union, it became known as a lawless and corrupt state. Eventually, Chechen militants began to gain a foothold in Dagestan.\n Dagestan has replaced Chechnya as the most volatile region in Russia, with reports of bombings, shootings, and kidnappings occurring every few days.", "date": "Fri, 19 Apr 2013 00:00:00 GMT", "id": "3371"}, {"title": "Boston Marathon Explosions: Thursday's Developments : NPR", "url": "http://www.npr.org/blogs/thetwo-way/2013/04/18/177726815/boston-marathon-explosions-thursdays-developments", "author": "-", "content": "Throughout the day, we'll be updating with the latest news about the two explosions Monday near the finish line of the Boston Marathon. The blasts killed three people and injured about 180. We'll also be publishing related posts as the day continues. (See this note about how we cover events such as this.)\nEnlarge image\nThe FBI released this photograph of a man they are calling a suspect in the Boston Marathon bombings.FBI\n5:45 p.m.  ET. Where Things Stand.\nINVESTIGATION: The FBI released images of two men who they say are suspects in the bombing of the Boston Marathon that left three people dead and injured about 180.\nFBI Special Agent in Charge Richard DesLauriers said the FBI identified one individual at first, but after reviewing video and other evidence they determined that another individual was also implicated.\nDesLauriers said one video shows a man wearing a white baseball cap dropping off a bag in front of the restaurant, which was the site of the second explosion. The FBI released images and video of the men and they are asking for the public's help identifying them.\nThe images they released appear to come from surveillance cameras along the marathon route. They show two young men wearing baseball caps. Both of them appear to be wearing hoodies underneath black winter coats. Both of them are also carrying backpacks. In the video, the man wearing a white cap is seen walking closely behind the man wearing a black cap.\nDeLauriers did not release any other details of the investigation, because he said identifying and capturing the suspects is \"our highest priority.\"\nAt the website of the FBI's Boston bureau, officials have posted this appeal for help: \"If you have any information that could be of assistance, please call 1-800-CALL-FBI (prompt #3). No detail is too small.\"\nHe said no member of the public should try to apprehend the suspects because they are assumed to be \"armed and extremely dangerous.\"\nEMERGENCY DECLARATION: \"President Obama has signed an emergency declaration for the state of Massachusetts — a move that frees up federal funding to help with crisis management,\" WBUR writes.\nINTERFAITH SERVICE: At service Thursday morning in Boston's Cathedral of the Holy Cross, leaders from a cross-section of faiths spoke about the horror of the bombings — and the heroism and selflessness of those who rushed to help. President Obama, who assured the people of Boston that the nation stands with them and said to those responsible for the attack that \"we will find you,\" was there with first lady Michelle Obama. Mitt Romney, the 2012 Republican presidential nominee and a former governor of Massachusetts, is in attendance. We've put a copy of the program for the service below.\nUpdate at 7:02 p.m. ET. The Significance Of Suspect:\nNPR's Tom Gjelten tells our Newscast unit that what struck him about the press conference is that the FBI is now calling these two men \"suspects.\"\nEven Homeland Security Secretary Janet Napolitano called them people of interest during her testimony earlier today.\nThis change in terminology, said Tom, means the \"FBI now suspect the men of being responsible for this bombing at the Boston Marathon.\"\nTom also points out that the men ended up at the two bomb sites separately, but earlier they were seen walking close to each other.\nUpdate at 5:33 p.m. ET. Images:\nWe've added one of the images released by the FBI at the top of this post. The agency has posted 10 others on its website.\nThe FBI is asking the public to call 1-800-CALL-FBI, if they have any information about the suspects.\n\"Somebody out there knows these individuals as friends, neighbors, co-workers or family members of the suspects. Though it may be difficult, the nation is counting on those with information to come forward and provide it to us,\" DesLauriers said. He also added that no one should try to apprehend them, because they are presumed to be \"armed and extremely dangerous.\"\nUpdate at 5:28 p.m. ET. One Suspect Seen Dropping Off Bag:\nDeLauriers said that only one of the suspects is seen dropping off a bag near the scene of the explosion.\nDeLauriers did not release any other details of the investigation, because he said identifying and capturing the suspects is \"our highest priority.\"\nUpdate at 5:26 p.m. ET. Video:\nHere is one of the videos released by the FBI:\n YouTube\nUpdate at 5:23 p.m. ET. The Public's Help:\n\"We know the public will play a critical role in identifying the individuals,\" DeLauriers said. But he warned that people should not try to apprehend them, because they are \"armed and extremely dangerous.\"\nUpdate at 5:20 p.m. ET. Two Suspects:\nFBI Special Agent in Charge Richard DesLauriers says the FBI has identified two suspects. DesLauriers is showing images of two men. One of them is wearing a black hat the other is wearing a white hat.\nUpdate at 4:59 p.m. ET. Awaiting Press Conference:\nAn FBI news conference is scheduled to begin at any minute now. NPR will carry it live. We're expecting the FBI to release photographs of two men they are interested in speaking to.\nWe'll post those pictures as soon as we get them.\nUpdate at 4:25 p.m. ET. FBI Will Release Photos:\nAn official familiar with the investigation tells NPR that the FBI is interested in speaking to two men seen in photos or videos of the scene near the finish line at the race.\nAccording to the official, the FBI will release photos of the men during the press conference.\nBoth men are described as being in their 20s. Like Homeland Security Secretary Janet Napolitano, the FBI has not described them as suspects.\nUpdate at 4:03 p.m. ET. Number Of Critically Injured Down To 7:\nThe AP has some good news:\n\"Boston hospitals reported seven people in critical condition on Thursday, down from 14 on Wednesday.\"\nAccording to CNN's count, about 60 people remained hospitalized.\nUpdate at 3:46 p.m. ET. The Decision To Amputate:\nNo doubt one of the threads that we will follow for a long time to come will be the recovery of the bombing victims. As we've reported, many of them lost limbs in the attack.\nWBUR spoke to Tracey Dechert, a trauma surgeon at Boston Medical Center, about the gut-wrenching decision to amputate.\nShe explained that in a lot of ways making the decision quickly can be better in the long run. It's still doesn't make the decision any easier.\n\"Of course you would want everyone to have all their limbs,\" Dechert told WBUR. \"And even though you know down the road this is the best thing for them given the situation, it's still very sad, obviously, though.\"\nOn the same thread, The New York Times has a piece about how sports and war have inspired better design in prosthetics. The paper reports that 1,600 Americans lost limbs during the war in Afghanistan and Iraq.\n\"Now, the vast body of knowledge gained from treating those troops is likely to help speed and improve the recovery of people whose limbs were amputated after Monday's attack,\" the Times reports.\nUpdate at 3:06 p.m. ET. News Conference Scheduled:\nThe FBI has scheduled a news briefing for 5 p.m. in Boston. Of course, this is bound to change. If you remember, yesterday, the FBI scheduled press conferences but eventually called them off.\nUpdate at 12:25 p.m. ET \"We Will Find You\" And You Won't Beat Us:\n\"We will find you and yes, you will face justice,\" the president promises the person or persons responsible for the bombings. \"Small, stunted individuals who would destroy instead of build and somehow think that makes them more important\" don't understand that \"a bomb can't beat us,\" Obama adds.\n\"We will keep going ... we will finish the race,\" he also says, just like 78-year-old Bill Iffrig, the runner who the world saw get knocked over by one of the bomb blasts. Iffrig picked himself up and finished the last few yards of the marathon. \"We may be momentarily knocked off our feet, Obama says, \"but we will pick ourselves up.\" After his address, those in attendance sang \"America the Beautiful\" and the service came to a close.\nUpdate at 12:15 p.m. ET. \"They Picked The Wrong City\":\nThe president gets a standing ovation when he says that if \"whomever committed this heinous act\" thought they could intimidate or terrorize anyone, \"they picked the wrong city to do it!\"\nBoston, Obama says, will \"stand and walk and yes, run again ... of that I have no doubt.. ... You will run again because that's what the people of Boston are made of. Your resolve is the greatest rebuke to whomever committed this heinous act.\"\nUpdate at 12:07 p.m. ET. \"Every One Of Us Stands With You,\" Obama Says:\nThe president begins his remarks at the interfaith service by speaking of the beautiful day in Boston that in an instant, \"was shattered.\"\n\"A celebration became a tragedy,\" Obama says. His message, the president continues, is that \"every one of us has been touched by this attack on your beloved city. Every one of us stands with you.\"\nUpdate at 12:02 p.m. ET. Having Faith When Things Don't Make Sense:\nHis faith, says Massachusetts Gov. Deval Patrick, teaches that \"in everything, give thanks. That isn't always easy to do.\" But after Monday's \"cowardice,\" he found reasons to give thanks — for the first responders, the volunteers, the medical professionals, the police and most of all, the people of Boston who \"let their first instinct be kindness.\"\n\"The grace this tragedy exposed is the best of who we are,\" Patrick added just before introducing President Obama.\nUpdate at 11:50 a.m. ET. Goodness In The Face Of Evil:\nMonday's \"act of senseless violence\" is a reminder of the \"darkness that can lurk in the human heart,\" says Cardinal Sean O'Malley, head of the Roman Catholic Church in Boston. But the way so many reacted is a reminder that \"there resides in people's hearts a goodness that is incredibly selfless,\" he says. The cardinal is to be followed at the interfaith service by a performance from cellist Yo-Yo Ma.\nUpdate at 11:42 a.m. ET. \"Blessed Are The Peacemakers\":\nThe Gospel reading is from Matthew 5:1-12, and is read by Bishop John M. Borders III of Morning Star Baptist Church in Mattapan, Mass.\nUpdate at 11:38 a.m. ET. \"Up To The Mountain.\"\nA very emotional moment at the interfaith service: As the Boston Children's Chorus sings Patty Griffin's \"Up to the Mountain,\" tears flow down the cheeks of one young singer's cheeks.\nUpdate at 11:34 a.m. ET. \"Joy Comes In The Morning\":\nThe interfaith service continues. Even as God \"allows hatred and fanaticism to have its moment, says Rev. Roberto Miranda of Congregación León de Judá in Roxbury, Mass., \"in the end, goodness will always prevail. ... Weeping may stay for the night, but joy comes in the morning.\" Reminder: We've posted the program for the interfaith service below.\nUpdate at 11:30 a.m. ET. \"We All Have Service To Perform\":\nNasser S. Wedaddy, chair of the New England Interfaith Council and civil rights outreach director at the American Islamic Congress, also praises those \"who stepped forward\" and says \"we all have service to perform. ... To heal, to rebuild and to serve once again as a shining city on the hill.\"\nUpdate at 11:24 a.m. ET. A Mention Of The Tragedy In Texas:\nRabbi Ronne Friedman of Boston's Temple Israel includes a mention of those killed and injured Wednesday night in West, Texas, where a fertilizer plant exploded. \"Our arms are wide enough to hold you as well,\" he says.\nUpdate at 11:22 a.m. ET. \"May You Run And Not Grow Weary\":\nAt the interfaith service, Rev. Nancy Taylor of Old South Church tells how her place of worship holds a service for Boston marathoners each year. The church sends the runners off with these words from the Prophet Isaiah: \"May you run and not grow weary, may you walk and not grow faint.\" On Monday, she says, she saw marathoners running \"toward the danger\" and sacrificing themselves for others.\nUpdate at 11:14 a.m. ET. Mayor Menino Has Never Loved Boston More Than Now:\nHis voice choking, Mayor Thomas Menino (D) says that after the bombings, \"love has covered this resilient city. I have never loved it and its people more than I do today.\" He praises \"the brave ones who felt the blast and still raced to the smoke.\" The love and the bravery gives those in Boston, the victims and their families the strength to carry on, he says. \"We triumphed over that hateful act,\" Menino adds. Reminder: We've posted the program for the interfaith service below.\nUpdate at 11:08 a.m. ET. Thanks For Those Who Helped The Victims:\nAfter praying for the victims, Eminence Methodios, head of the Greek Orthodox Church in Boston, thanks God \"for the police and firefighters, the National Guard, for the doctors and nurses, for all who responded selflessly and courageously.\"\nUpdate at 11:05 a.m. ET. \"We Will Rise\":\n\"Through the blur of each other's tears, we will rise in one community ... resolutely, as one,\" says Rev. Liz Walker of Roxbury Presbyterian Church, as she opens the interfaith service.\nUpdate at 10:55 a.m. ET. Interfaith Service Is About To Start:\nThe president and first lady Michelle Obama just took their seats in Boston's Cathedral of the Holy Cross. WhiteHouse.gov is among the websites streaming coverage of the service.\nUpdate at 10:45 a.m. ET. FBI Wants To Speak With Two Men, Napolitano Confirms:\n\"Homeland Security Secretary Janet Napolitano says the FBI wants to speak with two men seen in at least one video from the Boston Marathon, but she says she isn't calling them suspects,\" The Associated Press reports.\nThe wire service adds that \"without providing details of the men's appearance or what the video shows, Napolitano told the House Homeland Security Committee on Thursday that 'there is some video that raised the question' of two men the FBI would like to interview but said she wouldn't described them as suspects. Napolitano said it's still unclear whether the bombs that exploded near the finish line of the Boston Marathon were the work of foreign or domestic terrorists. She said the investigation is continuing 'apace.' \"\nUpdate at 10:25 a.m. ET. President To Meet With Victims, First Responders:\nReporters traveling with the president, including NPR's Ari Shapiro, report he plans to spend some time today meeting with people who were injured in the bombings and with the first responders who rushed to help the victims.\nUpdate at 10:10 a.m. ET. People Lined Up Hours Ahead Of Service, And A Look At The Program:\nThere were people in line as early as 5 a.m. ET for the interfaith service, WBUR reports.\nThe program for this morning's service shows it will begin with the hymn \"Praise to the Lord, the Almighty,\" that the Boston Children's Chorus will sing Patty Griffin's \"Up to the Mountain\" and that there will be \"reflections\" from both Massachusetts Gov. Deval Patrick and President Obama.\nUpdate at 9:10 a.m. ET. Images Of Two Individuals May Soon Be Released:\n\"Authorities have clear video images of two separate suspects in the Boston Marathon bombings carrying black bags at each explosion site and are planning to release the images today in an appeal for the public's help in identifying the men,\" The Boston Globe reports. It cites \"an official briefed on the case\" as its source.\nFor more:\n— Wednesday's Developments.\n— Tuesday's Developments.\n— NPR's Coverage.\n— WBUR's Coverage.\nNote: As happens when stories such as this are developing, there will likely be reports that turn out to be mistaken. Wednesday, for example, there were reports from CNN, the AP, WBUR and others that authorities either had arrested a suspect or were about to do that. It turned out that no one had been arrested or taken into custody.\nWe will focus on news being reported by NPR, other news outlets with expertise, and statements from authorities who are in a position to know what's going on. And if some of that information turns out to be wrong, we'll update.\nTake me back to the top of this post.", "date": "-", "id": "815"}, {"title": "Dzhokhar Tsarnaev Deleted His Instagram Account Before Bombings", "url": "http://gawker.com/dzhokhar-tsarnaev-deleted-his-instagram-account-before-483766951", "author": "-", "content": "", "date": "-", "id": "6599"}, {"title": "-", "url": "-", "author": "-", "content": "-", "date": "-", "id": "6959"}, {"title": "Shanghai Bishop Jin Luxian Dies at Age 96", "url": "http://abcnews.go.com/International/wireStory/shanghai-bishop-jin-luxian-dies-age-97-19063283", "author": "ABC News", "content": "Shanghai Bishop Aloysius Jin Luxian, who revived the Catholic church in China's financial hub after years of Maoist persecution, has died. He was 96.\n Jin's death on Saturday leaves one of China's largest and wealthiest dioceses in a deeply unsettled state, underscoring continuing tensions generated by the ruling Communist Party's insistence on tightly controlling all organized religions.\n Jin's first anointed successor as acting bishop, Joseph Xing Wenzhi, resigned last year for reasons still unclear, and his replacement, Thaddeus Ma Daqin, was placed under house arrest at Shanghai's Sheshan Seminary after enraging party officials by renouncing his membership in the party-controlled Catholic Patriotic Association.\n Born into a Catholic family in Shanghai in June 1916, Jin was ordained as a Jesuit priest in 1938 and spent several years studying in France, Germany, and other European nations. Returning to his native Shanghai in 1951, Jin was imprisoned for nearly two decades under Communist China's founder, Mao Zedong, who ordered Chinese Catholics to cut their ties with the Vatican and jailed hundreds of priests and nuns as counter-revolutionaries.\n Jin was paroled in 1972 and put to work as a translator based on his knowledge of several European languages. Following Mao's death in 1976, he was formally released and named Shanghai bishop in 1988 by the Patriotic Association. Although the Vatican recognized another priest as Shanghai bishop, Jin worked tirelessly to recover church property and rebuild congregations, achieving a remarkable degree of independence from the authorities in Beijing.\n China has an estimated 8 million to 12 million Catholics, around half of whom worship in congregations outside the control of the Patriotic Association.\n Jin served on the official advisory body to China's rubber-stamp parliament as well as the Patriotic Association, making him a frequent target of critics who argued he was too cooperative with the authorities.\n He acknowledged those complaints in a 2005 interview with The Associated Press, saying he hoped the appointment of his successor would heal the rift between the official church and the semi-clandestine one that defies party control. The two disagree most sharply over the appointment of bishops, and it remains unclear whether the Vatican and Beijing will be able to forge a consensus on a new Shanghai bishop.\n \"Bishop Jin Luxian loved the country and the church all his life,\" the official Catholic association said in a statement on its website. \"His death is not only a great loss for the Shanghai diocese, but for the entire Catholic church in China.\"\n In a statement, U.S. Ambassador to China Gary Locke said Jin had \"worked diligently to promote understanding between Chinese Catholics of all persuasions and provided a beacon of hope for reconciliation between China and the Holy See.\"\n \"We hope that his legacy of devotion to both his faith and his countrymen will long provide a model for others to follow,\" Locke said.", "date": "Mon, 29 Apr 2013 00:00:00 GMT", "id": "6081"}, {"title": "Explosions at the Finish Line: Two Eyewitness Accounts of Boston’s Marathon Attack", "url": "http://newsfeed.time.com/2013/04/15/boston-marathon-eyewitness/", "author": "-", "content": "TheLogician\nThat might have been North Korea's nuke strike. I kid, I kid.\n JimMorgan\nWell, possible suspects:\n1) Representatives of the 'religion of peace'\n2) North Korean agents\n3) Right wing gun nuts\n TheLogician\nOf course, it must be the republicans. And your proof is...?\n usman.ur.rehman.ahmed\nUS bomb kills 30 at Afghan wedding: at least 120 people had been either killed or wounded. N'd you won't cover them. They were not humans? Which super power does that? What kind of people pay tax for such governments.\nhttp://www.dailymail.co.uk/news/article-125820/US-bomb-kills-30-Afghan-wedding.html\n DennisMadden\nWhere is our MAN OF THE YEAR OBAMA???????????\n JeffHenderson\nAnd this is why congress needs to have the balls to completely terminate all student visas and all immigration to the US from middle east nations. Add that to your immigration reform measures and smoke it. Their culture is disrespectful of women, and the rights we hold so dear in the USA. These people will not integrate into our society and we shouldn't hold back in saying that our way of life is superior to theirs in every way. We cherish equality, our freedom to speak out, to worship and debate in a free democratic process. I know someone will come back and try to claim the US isn't all that great, but it is the best system there has ever been. We are risking a great deal by letting this multicultural bs go too far. As an Atheist I find the kind of violence being perpetrated against others in the name of a god the most deplorable and ignorant of all acts. It is an ideology that needs to either be stamped or starved out completely. Sure not all people from the middle east are violent people, but I wouldn't increase the risk of something like this happening again just to be a humanitarian. These war mongers and violent societies need change their ways and embrace an enlightened way of thinking or recede back into the dark ages where they belong forever.\n MajVariola\nWhy do you post authoritatively on things you know nothing about?\n\"There was a smell, a smell that something bad had happened. I lived in NYC during 9/11 so I know what an explosion smells like. The cruise missile that took down the WTC was dieselfueled and there was no explosion. Though if you only based your life on hollywood....\nThe pipe bomb you just enjoyed was black powder. Little blast, some shrapnel. Yawn, early 18th century stuff.\nBP is just a low-order material you must confine or it does nothing.Cf. a brisant explosive which will cut steel merely by sitting on it.\n cybervigilante\nThe explosions were not simultaneous so they weren't triggered by a cell phone. The delay between explosions was just enough time for someone to set a timer, cross from one side of the street to another, and set a second one. He probably set them for the same delay for simplicity. They need to review tapes and look for someone crossing the street with a package, sometime before the explosions. You wouldn't set a Long time or it might be discovered.\n JimMorgan\nprobably an egg or washing machine timer\n MajVariola\n@cybervigilante\nYou also know nothing of the craft. You set the Second for the First responders.\n TheLogician\nFirst off, it isn't a jihadist group, they know where to put the bombs, definitely not professional, at least 3 did not explode. The device was not C4, or TNT, probably a cherry bomb hooked to a delay, usually a cigarette in a matchbook. Or it could be a mix of gunpowder and saltpeter, hooked to a lighting mechanism which could be activated by cellphone. Definitely he or he was not trained and did not have a plan, probably an anarchist or another extremist\n cybervigilante\n@TheLogician Cherry bomb? I used to throw those on the Fourth. They were a bit larger to blow limbs off.\n JamesLAngelle\n Explosive devices arranged for maximum tactical effectiveness:\nBOSTON MARATHON MINEFIELD: CLAYMORE STYLE\nhttp://officeofstrategicservices.blogspot.com\n LogicalPosition\n AnatolePushkin\nWhy are the Republicans silent?\nWhere are the loquacious Rand Paul and his twin Paul Ryan?\n AnatolePushkin        1 Like\nNRA should be declared a terrorist lobby group.\n TheLogician\nAnatole, shut up. Just because they want guns do not make them terrorists. Maybe the liberals should be declared totalitarians or communists.\n demonknight11b        1 Like\n sgreco1970           2 Like\nThe last mile was dedicated to the newtown victims and many of their families were present. I'm willing to bet this was set up by some NRA gun nut who thinks they're fighting \"tyranny.\" When we find whomever did this, we will humiliate them in court and in the media and see them either imprisoned for the rest of their lives or executed. Whoever you are, if you did this and you're reading this, your time is running out. Tick tock. You'll be in custody by the weekend.\n TheLogician\n cybervigilante\n@sgreco1970 If you watched the fulminating rage of some NRA types about the \"gun grab\" you're realize how insanely angry they are. They also claim Newtown was a hoax, and the \"families\" are professional actors hired by the \"gummint,\" who would deserve to die.\n jjparkerjim121\n alienstarship\n @sgreco1970 I would not be surprised if you are right. And when he or she or they are caught they do not deserve to breath air on this planet.\n KindaSorta2              3 Like\n @sgreco1970 Wow. I can't believe even the smallest lib brain could concoct such stupidity.\n MorningMist\n@KindaSorta2 @sgreco1970 Timothy McVeigh did it. Wasn't he pro-gun anti government too? Not as farfetched as you think.\n sgreco1970\n@KindaSorta2 @sgreco1970 Really? All we've heard for months since newtown is how you righties are going to secede and take up arms against tyranny. Now its unthinkable that one of you disturbed maniacs has done it?\nCry revolution less often if you want it to be unthinkable that you'd do it. In fact, quit all of your crying.\n Canny2b\n@TIME I hope the people are in good condition?\n JoeOberman        1 Like\nAnd, the LIBERALS want to take away law abiding citizens right to keep and bear arms to defend themselves.\n sgreco1970\n@JoeOberman given that this was probably done by a citizen, you can see the need to keep dangerous materials out of the hands of right wingers.\n rhomea        1 Like\n@JoeOberman I am likely a \"liberal\" by your definition and I own guns my whole life. I enjoy shooting. BUT a) Neither I nor anyone else wants to take away that right any more than making people get a license, insurance and jailing people who drive drunk is \"taking away the right\" to drive a car and b) what a moronic reply. what good would a gun have done ? SMH... Please put your partisan political absurdity on hold for a day out of respect for the dead an injured.\n TheLogician\nAre you telling that to people who are saying it was a gun nut who hit the detonator?\n cybervigilante\n@TheLogician Two separate detonations. Probably a timer. And again, police rushed Toward the danger to save lives. The rightwingers Hate the police.\n GoVikes        1 Like\n Thank Barak Husain Obama's jihadi friends for this.......\n cybervigilante\n@GoVikes You really are nuts. Obama has killed more jihadists with drone strikes in a month than Bush did in a year.\n rhomea\n@GoVikes another lunatic fringe member heard from. In case you haven't bothered to read a newspaper, PRESIDENT OBAMA has kept his \"jihadi' brothers in Guantanamo, has bombed/droned the livin shyte out of them in 3 countries for 4 years now. Don't let those pesky facts intrude on your bigoted belief system...\n TheLogician\nHmm, wait, did you say that to those saying it was definitely a member of the NRA? They who posted that are lunatics as well\n sgreco1970           2 Like\n@GoVikes what an insipid comment. We'll \"thank\" anti-american lunatics like YOU for this.\n LogicalPosition        1 Like\nBoston harbored and launched the 911 attacks, too. Arabic males 17-40 yrs old is the certain profile.\n rhomea\n@LogicalPosition April is a month that has witnessed many terror attacks: Friday will be the 20th anniversary of Waco and 18th anniversary of Oklahoma City, Saturday will be the 14th anniversary of Columbine ... ALL PERPETRATED BY AMERICANS. So no that would NOT be the certain profile\n LogicalPosition\n GalacticCannibal                 4 Like\nAh yes the Americans Dream is alive and gets bloodier by the day. Why the surprise ?. When the USA is the most violent country of all the industrialized countries in the West. This small bombing at the Boston marathon, happens in a massively larger scale every week in Iraq and Afghanistan . Two countries we invaded and killed thousands of people there.. I don't hear Pres Obama or US Congress getting so mad about those bombings in Iraq or Afghanistan . Oh I forgot our national media propaganda machine, goes into full swing for any sensational killing at home that will sell more copies to the masses. Or give the politicians a leg up to be re-elected. Hypocrisy , greed and warmongering rule our country . How damn sad .that is.\n cybervigilante\n@GalacticCannibal The CIA created Iran in its present state, Al Quada, and the horrible mess in Africa. We do tend to shoot ourselves in the foot.\n carolduncan\n@TIME Do you have a photographer on deck at the moment that I could do a quick interview with?\n the_green_egg\n@carolduncan massage nerd was there\n carolduncan\n carolduncan\n the_green_egg\n the_green_egg\n@carolduncan I thought he was, he's on Facebook, he has a Massage Nerd Page, i am friends on FB- Ryan Hoyme\n carolduncan\n the_green_egg", "date": "-", "id": "41"}, {"title": "A night of appreciation | Boston Herald", "url": "http://bostonherald.com/sports/celtics_nba/boston_celtics/2013/04/a_night_of_appreciation", "author": "-", "content": "The floor was rather crowded for the Celtics’ traditional Heroes Among Us segment at the end of the first quarter last night.\nThen again, that’s quite understandable in light of recent events surrounding the Boston Marathon bombings. In fact, the parquet isn’t nearly big enough to fit all those who offered brave medical assistance on Monday, April 15, and who aided in the law enforcement effort then and in subsequent days.\nRemembrance and recognition of the situation that so affected and inspired the area and beyond began when a pregame moment of silence was observed for the four who died in the bombings and pursuit of the suspects.\nMembers of the Boston Police Department, Boston Fire Department and Boston Emergency Medical Services comprised the honor guard for the national anthem.\nThey received a loud ovation from the crowd, which had been given white “Boston Strong” T-shirts upon their entry to the Garden.\nThe Celtics, meanwhile, were decked out in green shootaround shirts with the words: Boston Stands As One.\nDuring breaks in the game, marathon-related videos and inspiration quotes from President Obama and others were shown on the large screens above center court.\nIn one first-quarter timeout, members of the Wounded Warriors Project were honored with a standing ovation.\nIn another, some of the medical people and police officers who helped get wounded MBTA officer Richard Donohue to safety and prevented more serious injury were recognized.\nAt the end of the period, an ovation rose as Gov. Deval Patrick came onto the court with, according to a list provided by the Celtics, Lt. Col. James Hanafin, deputy superintendent of the state police; FBI Special Agent in Charge Boston Division Peter Kowenhoven; FBI Assistant Special Agent in Charge Boston Division Jeffrey Sallet, Watertown Police Chief Ed Deveau; Dr. Heidi Kimberly, Dr. Michael Weaver, Dr. Christian Sampson, R.N. Janet Gill, R.N. Dennis Sullivan, R.N. Erin Emerling, R.N. Brenda Craig of Brigham and Women’s Hospital; Dr. Liz Mitchell and Nurse Jennifer Kelley of Boston Medical Center; Dr. David Mooney and Nurse Jessica Sexton of Boston Children’s Hospital; R.N. Megann Prevatt of Massachusetts General Hospital; M.D Charles Cassidy and R.N. Julie Compton of Tufts Medical Center; Members of the Mass State Police, Boston Police Department, Watertown Police Department and Cambridge Police Department and Youth Violence Strike Force; and volunteers from Boston Athletic Association.\nAt the end of the ceremony, it was announced that, “They are all — and will always be — ‘Heroes Among Us.’ ”\nCeltic coach Doc Rivers was busy trying to get his team out of a 23-18 deficit at that point in the night. Prior to the game, however, he acknowledged the importance of the evening’s plan for remembrance and appreciation.\n“It will be nice. They’ve been through a lot,” Rivers said of those who served. “They can’t get enough support, they can’t get enough love. I think it will be absolutely wonderful for them and the fans as well.\n“You don’t get many chances to say thank you to firemen and police. My dad was a cop (in Chicago). It’s nice that people have a chance and want to thank them. I haven’t talked to them today, but I make a point of it, honestly, every day. I’ve always done that.\n“I had a dad who was a cop, so I know how it is. No one wants you around or likes you until they need you. So I’ve always done that.”\nLast night, the Celtics and their fans did so, as well.", "date": "Sat, 27 Apr 2013 00:00:00 GMT", "id": "6050"}, {"title": "A ballet near-riot for the ages", "url": "http://www.bostonglobe.com/opinion/2013/05/26/ballet-near-riot-for-ages/uNrgTiSdQ5PcWp8fHs2FKM/story.html", "author": "-", "content": "A dancer in “The Rite of Spring.”\nThe worldwe live in was born 100 years ago this week, and a glance back at that birth can help make a better world going forward. The threshold event was the premiere in a Paris theater, on May 29, 1913, of Igor Stravinsky’s ballet “The Rite of Spring.” Discordant music, wholly unconventional choreography, and narrative incoherence led to a near-riot in the audience, and a sensational argument among critics. That the instigators of this outrage were Russian artists politicized the aesthetic revolt: “We were all revolutionists,” said Stravinsky’s collaborator Sergei Diaghilev. And what revolutions followed!\nIf Stravinsky’s music seemed anarchic, so did his theme — old men in whose approving presence the young are destroyed. The ballet’s segments moved from “the ritual of the rival tribes” to “the great sacrifice,” during which the chosen maiden thrills the elders by dancing herself to death. That Stravinsky’s original title for the piece was “The Victim” soon resonated with the experience of a generation.\nOnly in hindsight does “The Rite of Spring” emerge as a cultural marker, a kind of forecast of the moral anarchy of World War I. That connection informs the title of historian Modris Ekstein’s 1989 book, “Rites of Spring: The Great War and the Birth of the Modern Age.” The sinking of the Titanic took on retrospective symbolism once Europe had suicidally wrecked itself at the Western Front, and so did Stravinsky’s prophetic assault on convention. The old men of Europe sacrificed the continent’s young, who, like the maiden, willingly gave themselves to death.\nFrom the vantage of a full century later, when that tragic epoch is regularly evoked through a nostalgic haze in blockbusters like “Downton Abbey” and the latest movie version of “The Great Gatsby,” both “The Rite of Spring” and World War I can be seen as flags of a moral transformation that is still unfolding today.\nGatsby, as Brooks Brothers reminds us, is a timeless American type, even if his story is set in 1922. Gatsby’s nihilism reeks of the trenches. Those who survived the Western Front became the Lost Generation, and the loss remains. They “told us the war was over,” one veteran wrote. “That was a laugh. We ourselves are the war.” From Verdun to Warsaw to Hiroshima to Bach Mai to Sarajevo to Chechnya to Baghdad to Damascus — we human beings have ourselves become the war. How?\nStravinsky’s work generated an effervescence of dispute which was thrilling to those caught up in it. The start of the Great War did something similar, at least at first; a cry resounded in the streets of Europe, “It’s on!” For Germany, the war promised purification of decadence. France foresaw “La Grande Manifestation” of national glory. Britain aimed, in a phrase coined by H.G. Wells, at the war to end all wars. For the United States, it would be, in Wilson’s slogan, the war to make the world safe for democracy.\nEach projection was millennial, with the destruction, no matter how total, expected to usher in a kind of secular salvation. That subliminal mysticism, foreseen by Stravinsky, locked itself on the human imagination. For the 100 years since — in death camps, bombed cities, torched villages, blown-up cafes, booby-trapped roadsides, airliners-turned-missiles, and the sights of unmanned drones — the apocalyptic principle of salvation through destruction has ruled, and still threatens us today.\n“The world broke in two in 1922 or thereabouts,” as Willa Cather put it. Fascism, Nazism, and Stalinism all emerged from that break. At great cost, they were defeated. But the crack in the world remained, and humans kept trying to fill it with the corpses of enemies. Stravinsky’s “Rite of Spring” regeneration depended on violence, as if there were no life but through death. The primacy of death was Stravinsky’s outrageous idea, which he offered as a warning. Yet it played out quite literally among “rival tribes” on the century’s battlefields.\nWith lessons learned, the next 100 years can be different. Wars rage today, yes. But they outrage, too. Our species is suddenly capable of truly global communication and transnational economic cooperation. Borders mean nothing to the Web. Our planet has itself become the universal village — which means no more saving the village by destroying it. Millennial illusions, on which total war depends, are unsustainable. The world that broke in two can be one again, the lost generations found.\nJames Carroll writes regularly for the Globe.", "date": "Mon, 27 May 2013 00:00:00 GMT", "id": "9667"}, {"title": "Boston police commissioner 'fine' with death for bombing suspect", "url": "http://now.msn.com/edward-davis-boston-police-commissioner-fine-with-death-penalty-for-dzhokhar-tsarnaev", "author": "-", "content": "photos\nviral videos\nanimals\nfunny\ncollege\ngood\nweird\nDASHBOARD\nBoston Police Commissioner Edward Davis has no problem with Boston terror suspect Dzhokhar Tsarnaev getting the death penalty. \"That's fine with me\" was the sentiment from the man whose job it was to hunt down the bombers. But will Tsarnaev face the death penalty for allegedly killing three people and injuring more than 250? The decision will likely not be made before summer 2014, after formal charges go before a grand jury. Davis, however, needs no deliberating: \"I watched this young man put a satchel on the ground which blew up and killed an 8-year old boy and a young woman standing next to him. I have no sympathy for him.\" [Source]\n Click to see more on msnNOW.com, updated 24 hours a day.", "date": "-", "id": "6512"}, {"title": "Interfaith group holds vigil to honor Boston bombing victims", "url": "http://fox6now.com/2013/04/21/interfaith-group-holds-vigil-to-honor-boston-bombing-victims/", "author": "A", "content": "Posted on: 9:11 pm, April 21, 2013, by A.J. Bayatpour, updated on: 09:53pm, April 21, 2013\nRACINE (WITI) — The Racine Interfaith Coalition came together Sunday, April 21st in a vigil for the Boston bombing victims, as well as the victims of the Texas explosion and the earthquake in China.\nThe group holds a vigil every time there’s a murder in their community. They also come together after major tragedies around the world. “People do have a need to come out in community and talk about these things and about how important it is for us to be together as a community in times of crisis,” said Father Yeprem Kelegian.\nVigils like these have become a custom for the coalition since the Oklahoma City bombing. The group, compromised of 23 congregations, unites in prayer whenever there’s violence at home and abroad.\nThe Boston bombings hit close to home for Father Kelegian. He once led services at an Armenian church in Watertown, Massachusetts. “We were getting a lot of Facebook messages from St. James Armenian Church in Watertown, which was used as a command center,” he says.\nKelegian says beyond that, there’s a bond between the two communities far bigger than any individual connection. “We’re all one people. Boston – one time zone away, one plane trip, they are us. We’re together in this, no matter where in the world it happens, we’re all people. We’re all together in this.”\nEveryone at the vigil was given a black ribbon to wear as a symbol of the lives lost in Boston, Texas and China.", "date": "Sun, 21 Apr 2013 00:00:00 GMT", "id": "2856"}, {"title": "Friend Of Boston Bombing Suspect Killed In FBI Shootout", "url": "http://www.wibw.com/home/nationalnews/headlines/Friend-Of-Boston-Bombing-Suspect-Killed-In-FBI-Shootout-208469341.html", "author": "-", "content": "The FBI was involved in a fatal shooting near Universal Studios in Orlando, Fla., early Wednesday that killed a man with ties to the older brother suspected in last month's deadly terrorist bombing at the Boston Marathon.\nCBS News senior correspondent John Miller, a former FBI assistant director, reported on \"CBS This Morning\" that the man, Ibrahim Todashev, was friends with Tamerlan Tsarnaev, a suspect in the attack that killed three people and injured more than 260 others.\nThe FBI has not commented on the relationship between Todashev and Tsarnaev.\nMiller reported that FBI agents went to Todashev's apartment complex after midnight Wednesday morning to question him. Todashev had been on the bureau's radar since Tsarnaev was identified as a suspect in the bombing.\n\"He had been interviewed along with a number of other people in the apartment complex, but the interest in him was higher because of a couple of factors: He was in contact with Tamerlan Tsarnaev. He had been to Boston to visit him, and he was planning a trip to Chechnya,\" Miller said.\nFBI agents went to question him overnight after there were indications that he canceled that trip, Miller said.\n\"In the encounter in the apartment, something went wrong,\" Miller said.\nIn a statement Wednesday, the FBI said, \"We are currently responding to a shooting incident involving an FBI special agent. The incident occurred in Orlando Florida. The agent encountered the suspect while conducting official duties. The suspect is deceased. We do not have any further details at this time. We expect to have more information later this morning.\"\nTamerlan Tsarnaev was killed in a shootout with police outside Boston in the days after the marathon bombings. His younger brother, Dzhokhar Tsarnaev, remains in federal custody awaiting trial.", "date": "Wed, 29 May 2013 00:00:00 GMT", "id": "9543"}, {"title": "2nd Boston Marathon bombing suspect captured", "url": "http://www.cbsnews.com/8301-504083_162-57580553-504083/boston-marathon-bombings-update-dzhokhar-tsarnaev-second-bombing-suspect-captured-alive-in-backyard-boat/", "author": "Crimesider", "content": "Boston Marathon bombing suspect Dzhokhar Tsarnaev was captured by police on Friday, April 19, 2013. / CBS News  (AP) WATERTOWN, Massachusetts - A 19-year-old college student wanted in the Boston Marathon bombings was taken into custody Friday evening after a manhunt that left the city virtually paralyzed and his older brother and accomplice dead.\nPICTURES: Boston bombing victims\nPICTURES: Boston Marathon bombing suspects\nPolice announced via Twitter that Dzhokhar Tsarnaev was in custody. They later wrote, \"CAPTURED!!! The hunt is over. The search is done. The terror is over. And justice has won. Suspect in custody.\"\nTimeline of events in the manhunt for the Boston Marathon bombing suspects\nTsarnaev's brother, 26-year-old Tamerlan, was killed early Friday in a furious attempt to escape police.\nDzhokhar Tsarnaev had been hiding in a boat in a neighborhood near Boston. The crowd gathered near the scene let out a cheer when spectators saw officers clapping.\n\"Everyone wants him alive,\" said Kathleen Paolillo, a 27-year-old teacher who lives in the area.\nBoston Mayor Tom Menino tweeted, \"We got him.\"\nDuring a long night of violence Thursday into Friday, the brothers killed a police officer, severely wounded another officer and hurled explosives at police in a car chase and gun battle, authorities said.\nThe suspects were identified by law enforcement officials and family members as Dzhokhar and Tamerlan Tsarnaev, ethnic Chechen brothers who had lived in the Dagestan region in southern Russia. They had been in the U.S. for about a decade, an uncle said.\nTheir uncle in Maryland, Ruslan Tsarni, pleaded on live television Friday: \"Dzhokhar, if you are alive, turn yourself in and ask for forgiveness.\"\nAuthorities in Boston suspended all mass transit and warned close to 1 million people in the city and some of its suburbs to stay indoors as the hunt went on.\n\"We believe this man to be a terrorist,\" said Boston Police Commissioner Ed Davis. \"We believe this to be a man who's come here to kill people.\"\nThe bombings on Monday killed three people, including a student from China, and wounded more than 180, instantly raising the specter of another terrorist attack on U.S. soil.\nInvestigators in the Boston case have shed no light on the motive for the bombing and have said it is unclear whether it was the work of domestic or international terrorists.\nState Police spokesman Dave Procopio said police realized they were dealing with the bombing suspects based on what the two men told a carjacking victim during their getaway attempt overnight.\nShortly before Dzhokhar Tsarnaev's capture, the White House said President Barack Obama has spoken by phone with Russian President Vladimir Putin about the investigation.\nObama \"praised the close cooperation that the United States has received from Russia on counter-terrorism, including in the wake of the Boston attack,\" the White House said in a statement.\nComplete coverage of Boston Marathon bombings on Crimesider", "date": "Fri, 19 Apr 2013 21:38:38 GMT", "id": "1516"}, {"title": "Boston Marathon bombing Suspect #1's wife refusing to talk to the feds", "url": "http://americablog.com/2013/04/tamerlan-tsarnvaev-wife.html", "author": "John Aravosis", "content": "HomeNews Boston Marathon bombing Suspect #1′s wife refusing to talk to the feds\nI’m sincerely interested in what you guys think of this. It seems that the Boston Marathon bombing Suspect #1, Tamerlan Tsarnvaev – aka, the older brother in the black baseball hat, who died after getting into a shoot out with the police early Friday morning – is married. And the FBI, understandably, would like to speak to his wife, Katherine Russell Tsarnaev. So far, she’s reportedly said no, through her lawyer.\nAccording to press reports, federal officials came to her parents’ home Sunday night, asking for her – and her lawyer spoke to them instead.\n“I spoke to them, and that’s all I can say right now,” her lawyer said. “We’re deciding what we want to do and how we want to approach this.”\nTamerlan Tsarnvaev, Boston Marathon Bombing Suspect #1, who was killed after a gunfight last Friday morning.\nYou know, I read this story and it initially ticked me off. Against the wife.\nI tried to imagine how I’d react if my spouse were accused of plotting and executing a terrorist and act, and then subsequently acted like he was guilty (the whole shooting a cop in the head thing, in addition to rolling bombs at the police, assuming those reports are true). Still, it’s your spouse, and if you’re innocent, it has to be a pretty big shock finding all of this out. So I could see how it would be difficult to talk about it.\nBut Tamerlan Tsarnvaev died early Friday. This was Sunday night. At some point, mourning ends and suspicion begins.\nHaving said that, I could see why any Muslim might be concerned about speaking to the FBI, let alone one whose husband may be a huge terrorist. But her lawyer says she’s 100% innocent. So why won’t she talk to the FBI, especially when there’s understandable concern as to whether Tamerlan and his brother, Dzhokhar, were planning any other attacks, and it might be nice to know if those attacks are still moving ahead (did they have any accomplices, and where they working on behalf of someone else?) The lawyer says the wife doesn’t know, she had nothing to do with it, didn’t suspect a thing. Okay. Then why isn’t she talking?\nI’d have to think really hard about this, but if my spouse did this, I’d be pretty sad, and pretty ticked, and I’d probably want to do whatever I could to help, even if I didn’t think I have any relevant information. But then my lawyer hat goes on, and I wonder if I wouldn’t want a lawyer to negotiate my immunity, just in case someone tries to launch a witchhunt against me as the “Muslim” spouse of America’s #1 new terrorist.\nI’m sincerely divided when reading this story. Curious about your thoughts.\n John Aravosis\n @aravosis | Facebook | Google+. Editor of AMERICAblog, joint JD/MSFS from Georgetown, worked in the US Senate, World Bank, Children's Defense Fund, and as a stringer for the Economist. A frequent TV pundit, he has been on The O'Reilly Factor, Hardball, World News Tonight, Nightline & Reliable Sources. Full bio and article archive.\nShare This Post", "date": "Mon, 22 Apr 2013 00:00:00 GMT", "id": "3568"}, {"title": "Physical Legacy of Bomb Blasts Could Be Cruel for Boston Marathon Victims", "url": "http://www.nytimes.com/2013/04/17/us/physical-legacy-of-bomb-blasts-could-be-cruel-for-boston-marathon-victims.html?pagewanted=all", "author": "GINA KOLATA;JERÉ LONGMAN;MARY PILON", "content": "BOSTON — So many patients arrived at once, with variations of the same gruesome leg injuries. Shattered bones, shredded tissue, nails burrowed deep beneath the flesh. The decision had to be made, over and over, with little time to deliberate. Should this leg be amputated? What about this one?\n“As an orthopedic surgeon, we see patients like this, with mangled extremities, but we don’t see 16 of them at the same time, and we don’t see patients from blast injuries,” Dr. Peter Burke, the trauma surgery chief at Boston Medical Center, said.\nThe toll from the bombs Monday at the Boston Marathon, which killed at least three and injured more than 170, will long be felt by anyone involved with the city’s iconic sporting event. For the victims, the physical legacy could be an especially cruel one for a group that was involved in the marathon: severe leg trauma and amputations.\n“What we like to do is before we take off someone’s leg — it’s extremely hard to make that decision — is we often get two surgeons to agree,” Dr. Tracey Dechert, a trauma surgeon at Boston Medical, said. “Am I right here? This can’t be saved. So that way you feel better and know that you didn’t take off someone’s leg that you didn’t have to take. All rooms had multiple surgeons so everyone could feel like we’re doing what we need to be doing.”\nThe widespread leg trauma was a result of bombs that seemed to deliver their most vicious blows within two feet of the ground. In an instant, doctors at hospitals throughout the city who had been preparing for ordinary marathon troubles — dehydration or hypothermia — now faced profound, life-changing decisions for runners and spectators of all ages.\nSome victims arrived two to an ambulance, some with huge holes in their legs where skin and fat and muscle were ripped away by the bomb and with ball bearings or nails from the bombs embedded in their flesh. Others had severed arteries in their legs or multiple breaks in the bones of their legs and feet. The shock wave from the blast destroyed blood vessels, skin, muscle and fat. And at least nine patients — five at Boston Medical Center, three at Beth Israel Deaconess Hospital and one at Brigham and Women’s Hospital — had legs or feet so mangled they would need to be amputated.\nSome of the attendant medical professionals, said Julie Dunbar, a chaplain at Beth Israel, were faced with “more trauma than most ever see in a lifetime, more sadness, more loss.”\nThere were only three fatalities, which doctors say was because the blast, low to the ground, mostly injured people’s legs and feet instead of their abdomens, chests or heads. And tourniquets stopped what could have been fatal bleeding in many.\nDr. Allan Panter, 57, an emergency-room physician from Gainesville, Ga., was standing 10 yards from the blast near the finish line, waiting for his wife, Theresa, to complete her 16th Boston Marathon. Assisted by others, he said he used gauze wraps to apply tourniquets to several victims, including a man who appeared to be in his late 20s who lost both of his lower legs in the blast. He said he saw another six or seven victims with belts tied around their wounded legs.\nTourniquets, once discouraged because they were thought to cause damage to injuries, have returned to favor and have been used to treat wounds inflicted by explosive devices in the wars in Iraq and Afghanistan, Dr. Panter said.\n“With blast injuries to the lower extremities that we’re getting in the Middle East, you bleed out,” he said. Tourniquets “can help save lives. I don’t know if they helped in this situation, but it sure couldn’t hurt.”\nWhile there was some initial chaos in a medical tent near the finish line, and some screaming and moaning by victims, it was generally an orderly scene, Dr. Panter said. He assisted others in wheeling in a female victim who died, he said. He described 20 to 30 cots in the tent with IV bags that had been intended for dehydrated runners.\nAt least eight doctors and what seemed to be 20 or more nurses were stationed in the tent. A man with a microphone stood in the center of the tent to coordinate medical care. Arriving victims were assessed and categorized as 1 for critical, 2 for intermediate, 3 for “can wait” and “black tag” for anyone who appeared to be dead, Dr. Panter said. An emergency medical technician outside the tent coordinated ambulance service to hospitals.\n“All in all, it was a pretty controlled environment,” said Dr. Panter, who has been an emergency-room physician for 30 years. “I’ve seen a lot worse. They were without question ready — not ready for those type of injuries, but they were prepared.”\nOnce victims were transported to Boston’s hospitals, doctors had to carefully coordinate their response. Each has a story of where they were when the bombs went off and how they rushed to help and how, in some cases, they somehow just missed being victims themselves.\nDr. Alok Gupta, who directed the surgical response at Beth Israel, said he often goes to the finish line of the marathon to watch the race. But this year he was so tired that he took a nap. Then he heard ambulance sirens and helicopters outside his home in Back Bay, near the marathon finish. He was just beginning to wonder why the sirens had not dissipated and why the helicopters were hovering when his cellphone rang.\n“The call was broken up,” he said. “All I heard was ‘mass casualty.’ ” And “we need you,” he said.\nHe was out of the house in less than a minute and at the hospital five minutes later. Then he and his colleagues set to work. They cleared the emergency room, sending home those who could leave and sending others to beds elsewhere in the building. They cleared intensive care, sending patients to other areas of the hospital. Dr. Gupta directed a central command.\n“Surgeons were notified, emergency-room physicians were notified, operating-room personnel were notified, everyone was notified,” he said. Cellphone service in Boston was limited, so doctors, nurses and other medical professionals were contacted with text messages.\nAbout 10 minutes later, patients began to arrive. Each was put in a room and assessed. Doctors described the situation as calm and efficient.\nSeven patients at Beth Israel went directly to the operating room for emergency surgery to stabilize them, stopping bleeding for example. Five went to intensive care. At Brigham and Women’s Hospital, six patients went to the operating room and nine to intensive care.\n“I think a lot of these injuries are so devastating, it was pretty straightforward — they weren’t going to be able to salvage these things,” said Dr. Burke of Boston Medical Center. “We all would like to salvage whatever extremities we can, but one thing we’ve learned in trauma is when you get too much damage, you can create too much hassle, so you may get the amputation but it may be a year down the line. Ten operations, failed operations, addictions to narcotics for the chronic pains, all these kinds of things.” An early amputation, Dr. Burke added, can mean a quicker return to a normal life.\nBorrowing a tactic used by the military in Iraq, doctors at Beth Israel used felt markers to write patients’ vital signs and injuries on their chests — safely away from the leg wounds — so that if a patient’s chart was misplaced during a transfer to surgery or intensive care, for example, there would be no question about what was found in the emergency room.\nThose who needed surgery would often need more than one operation on subsequent days. Those with huge blast wounds that ripped out skin and muscle would need plastic surgery. Those with severed arteries would need surgery, too.\nMost of the injured taken to Beth Israel were no older than 50, said Dr. Michael Yaffe, a trauma surgeon at the hospital. A few were runners, but most were spectators who had prime viewing positions near the finish line.\nAt about 2 a.m. on Tuesday, the Beth Israel medical team left for home, to return again at 6. They examined each patient before they left and again when they returned. Often, in trauma, the doctors said, patients will not notice some of their injuries until the major injury is taken care of.\nThe Boston Marathon is so special, a day to celebrate athleticism and the thrill of the sport. For those runners who trained for months and now can be facing months or years or rehabilitation, and the end of their running days, the bombs took away “the thing they loved,” Dr. Yaffe said.\nIn the moments after the explosions, some patients recalled that they “thought they would die as they saw the blood spilling out,” said Dr. George Velmahos, chief of trauma services at Massachusetts General Hospital. When they awoke Tuesday and realized they were still alive, they said they felt extremely thankful, some even considering themselves lucky, Dr. Velmahos said.\n “It’s almost a paradox,” he said, “to see these patients without an extremity to wake up and feel lucky.”", "date": "Published: April 16, 2013", "id": "1043"}, {"title": "Bombing Suspects' Twisted Family Saga", "url": "http://abcnews.go.com/International/boston-marathon-bombing-suspects-twisted-family-history/story?id=19012097", "author": "ABC News", "content": "The history of the two Boston bombing suspects' family is a twisted one, woven with the various conflicts that have afflicted their ethnic homeland.\n Sitting at her kitchen table here, the suspects' aunt, Patemat Sulemanova, recounted from memory a complex family history involving a deportation by Soviet leader Josef Stalin, two Chechen wars, and a severe beating in the United States that ultimately brought the suspects' father back to this restive region in southern Russia.\n The suspects moved frequently when they were younger, bouncing between homes as they dodged conflicts before ultimately settling in the United States as refugees.\n RELATED: Boston Bomb Suspect Alarmed Russian Relatives With Extremist Views\n The father's side of the family is ethnic Chechen, but they were among the many Chechen families who were expelled from the region by Stalin in February 1944 when he considered Chechens to be disloyal during World War II. They resettled in Kyrgyzstan, which then was part of the Soviet Union. It was there that the suspects' father, Anzor Tsarnaev, was born and raised.\n He served his mandatory military term in the early 1980s in Novosibirsk, where he met his wife, Zubeidat Tsarnaeva. Her family was from Dagestan but she was in Novosibirsk to visit a relative.\n The two married and eventually returned to live in Kyrgyzstan. They had four children, two girls and two boys, the two suspects. The elder son Tamerlan was born in the region of Kalmykia and the younger son Dzhokhar was born in Kyrgyzstan.\n Bombing Suspect Told Mom 'I Love You' Moments Before Shootout: Report Watch Video\n Boston Bombing Suspect Reportedly Reveals Plot Details Watch Video\n Boston Bombing Suspect Charged With Using Weapons of Mass Destruction Watch Video\n The young couple decided to leave Kyrgyzstan after the collapse of the Soviet Union, and attempted to settle in Chechnya, but bloody wars there in the 1990s forced them to quickly return to Kyrgyzstan.\n PHOTOS: Week of Terror at Boston Marathon\n By 2001, they moved to Dagestan, where the mother still had family, when the boys were 14 and 7 years old. They only lived there for about six months before obtaining refugee status and resettling in the United States.\n The aunt said the parents would come back to Dagestan to visit from time to time, but the sons stayed in the United States.\n Tamerlan, the older son who died in a gun battle with police Friday, visited for the first time last year. His six-month stay has raised eyebrows among investigators looking into how and why he is suspected of becoming radicalized. Dzhokhar, the younger son who was taken alive Friday, was planning to visit Dagestan for the first time in May, the aunt said.\n The parents bought an apartment in Makhachkala, the Dagestani capital, with the hopes that their children would stay there whenever they visited.\n RELATED: Bombing Suspects' Mom: 'My Family Is in the Dirt'\n The mother, in a separate interview with ABC News, revealed that she and her husband divorced in the United States several years ago because the husband did not agree with her stricter embrace of Islamic traditions. The couple reconciled, she said, after they both moved to Dagestan and have been brought closer by their grief this week.\n A few years ago -- the aunt did not recall exactly when -- the father was severely beaten by what she described as a group of Russian athletes as he tried to defend another person from them. The beating left him with medical problems that did not improve with treatment in the United States.\n Eventually, with his health failing and having lost a significant amount of weight, the father decided to come back to Dagestan in May 2012. Tamerlan, his oldest son, had just arrived there a couple months earlier.\n Anzor Tsarnaev decided to pursue medical treatment, figuring that if he died, he would at least be buried here. The mother also moved in Dagestan a few months later because she was feeling homesick.\n During his six-month stay in Dagestan, Tamerlan made several trips to Chechnya to visit relatives along with his father, his aunt said. He returned to the United States in July, departing the region from the airport in Grozny, the Chechen capital.", "date": "-", "id": "4664"}, {"title": "Boston attacks turn spotlight on troubled region of Chechnya", "url": "http://www.smh.com.au/world/boston-attacks-turn-spotlight-on-troubled-region-of-chechnya-20130421-2i7xl.html", "author": "-", "content": "The possible motivations of the two brothers linked to the Boston Marathon bombings are as yet publicly unknown.\nOf Chechen heritage, they lived in the United States for years, according to friends and relatives, and no direct ties have been publicly established with known Chechen terrorist or separatist groups.\nYet, with at least one brother talking of Chechen nationalism on the Internet, their reported involvement in the marathon attack throws a spotlight back on one of the darkest corners of nationalist and Islamic militancy, and to a campaign for separatism and vengeance responsible for some of the most unsparing terrorist acts of recent decades.\nPeople take part in an anti-terror meeting in Red Square, Moscow, after the hostage-taking tragedy in Beslan. Photo: AFP\nFired by a potent mix of blood codes, separatist yearnings and Islamic militancy, Chechen groups have staged a string of intermittent but spectacular attacks in Moscow and elsewhere in Russia since the 1990s. They have bombed trains, planes and subways, attacked a rock concert and slammed a truck bomb into a hospital. In 2002, they seized a crowded theater in Moscow, an attack that culminated in a commando raid that killed 130 hostages.\n Advertisement\nIn the spring of 2004, a bomb placed in a stadium in Grozny, the regional capital, killed the Kremlin's hand-picked Chechen president. That summer, female suicide bombers with hand grenades brought down two Russian passenger jets nearly simultaneously, killing 90 people.\nDays later, a group of terrorists working for Shamil Basayev, the one-legged separatist military commander who was then Russia's most wanted man, stormed a public school in the small town of Beslan, in a nearby republic, leading to the deaths of more than 300 people, most of them schoolchildren, their parents and their teachers.\nA video grab from NTV Russian television shows security personnel helping a man believed to be the late Chechen president Akhmad Kadyrov, seconds after an explosion at a stadium in Grozny, May 9, 2004. Photo: Reuters\nSuch violence had typically been confined within Russia.\nReports, often based on little more than rumors or Kremlin-sourced leaks, of extensive Chechen involvement in terrorism or insurgencies elsewhere have been a staple of public commentary on such violence since 2001.\nThese reports — of Chechen snipers and bomb-makers appearing in one conflict after another, and of Chechens filling the ranks of armed groups in Iraq, Afghanistan and elsewhere — often proved to be exaggerated.\nPresident of Chechnya, Ramzan Kadyrov. Photo: Reuters\nChechnya's battles with Russia and against Russian rule had been fought in recurring if irregular cycles for centuries; Chechens did not have to travel to find their foes, much less their targets. In interviews many Chechen emigrants and fighters have emphasized that they consider their enemies to be local, not foreign.\nBut in time outside influences crept into the North Caucasus' homegrown war, and the moves and countermoves between Russians and Chechens spread beyond Russia's borders.\nTwo wars erupted between Russia and Chechen separatists in the 1990s. The first had old roots. Many Chechens, an independent Muslim people of the highlands, have long chafed at what they view as Russia's imperial rule. With the collapse of the Soviet Union and the breakup of the Warsaw Pact, Chechen separatists perceived a fresh chance to claim their own state.\nAt least 322 people, including 155 children, died during a bloody end to a hostage-taking at a school in the southern Russian town of Beslan, near Chechnya. Photo: Reuters\nChechnya's oil reserves provided an incentive for both sides to refuse to yield their claims, and Islam colored the fight. Arab fighters appeared in Chechnya with the onset of the first war, saying they had come to help fellow Muslims fight oppression.\nBy the mid- and late-1990s, several training camps operated almost openly in rural Chechnya, led in part by a foreign jihadi, Ibn al-Khattab.\nLater, however, many Chechens said the Arab influence had declined amid tensions between the Sufi Chechens and Sunni Arabs, who typically adhere to different Islamic traditions and practices. In addition, the allure of the wars in Iraq or Afghanistan, Chechens say, drew many Arab fighters away from Chechnya's mountains.\nAnd yet the ripple effects of the Chechen wars eventually played out in 2004 in the Arab emirate of Qatar, where Russian agents assassinated an exiled Chechen leader with a car bomb, and on the streets of Vienna in 2009 when Chechens gunned down a fellow Chechen who had broken from the Kremlin-supported leadership in the republic to file a complaint in the European Court of Human Rights. The complaint detailed torture by the Russian-backed security services, and the republic's current president, Ramzan A. Kadyrov.\nJust a week ago, the United States put Kadyrov, a former rebel turned ally of President Vladimir V. Putin of Russia and the primary subject of the torture complaint, on a secret list of Russian citizens banned from the United States for human rights abuses, according to people briefed on the list.\nCuriously, the most political of the video clips posted on social media by one of the Tsarnaev brothers was not aimed at the West, but at Kadyrov, who is loathed by many Chechens and regarded as a vicious Kremlin stooge.\nKadyrov on Friday dismissed the Tsarnaev brothers and any ties between the Boston bombing and Chechnya. \"The roots of this evil are to be found in America,\" he said in a post on Instagram.\nWith all its long-standing crosscurrents, and partly because of its seeming remoteness and small scale, the Chechen conflict has long confounded American leaders and policymakers.\nBoris Yeltsin, president of Russia immediately after the Soviet breakup, launched a war from 1994 to 1996 to re-establish control of the region. As Yeltsin's prime minister, Putin ordered a second war in 1999, after a brief period of Chechen self-rule that was characterized by criminality and accusations of terrorism.\nPutin waged a relentless campaign that included carpet bombing and the indiscriminate shelling of Grozny, with more ordnance than any European city had endured since World War II.\nWhile the United States has shared intelligence on Chechen militants with the Russian government over the years, American officials have been reluctant to be too associated with Moscow's Chechnya policies, which resulted in the destruction of Grozny, the deaths of tens of thousands of civilians and the indiscriminate imprisonment of many young men. Then, as open resistance declined, control was maintained by flagrantly rigged elections and collective punishment.\nAt one point during President George W. Bush's administration, a debate broke out over a proposal by a National Security Council official to effectively partner with the Russians in fighting Chechen rebels. Other officials from the State Department and Pentagon vociferously opposed it, arguing that the United States should not ally itself with the Kremlin's tactics.\nBy then what had started as a separatist revolt had partially assumed a jihadi cast. The Chechen cause had been adopted by the likes of Osama bin Laden and other foreign radicals, who tried to insinuate themselves into the struggle; several Chechen rebel leaders embraced Islam as a rallying cry.\nBin Laden's top deputy, Ayman al-Zawahri, had traveled to Russia in 1996 to explore the possibility of relocating operations to Chechnya and was arrested on a visa violation, only to be released several months later. Mohammed Atta, a future Sept. 11 hijacker, and other members of an al-Qaida cell initially wanted to join the jihad in Chechnya but were told it was too hard to get in and were advised to go to Afghanistan instead.\nWith the defection of some rebels like Kadyrov and his father, Moscow eventually re-established control over most of Chechnya. Much of Grozny was rebuilt.\nBut the separatist insurgency has never been extinguished. Whether the Boston bombing was tied to it is still unclear, but a generation of young Chechen men have never known a peaceful homeland, coming of age as young Muslims with few prospects at home in the Caucasus, and difficulties finding a place abroad.\nNew York Times", "date": "Sun, 21 Apr 2013 00:00:00 GMT", "id": "4029"}, {"title": "Dzhokhar Tsarnaev charged with conspiring to use WMD, may face death penalty — RT USA", "url": "http://rt.com/usa/suspect-awake-charges-questioning-210/", "author": "-", "content": "Dzhokhar Tsarnaev, the surviving brother implicated in the deadly Boston Marathon bombings, has been charged with using weapons of mass destruction to kill people, a federal crime which is punishable by death, the Justice Department said.\nFollow RT’s day-by-day timeline on Boston Marathon bombings\nThe Justice Department said on Monday that 19-year-old Dzokhar Tsarnaev had been charged with one count of using a weapon of mass destruction and one count of malicious destruction of property resulting in death.\nThe charges are punishable by death, life in prison, or any other indeterminate prison sentence, the department said in a statement.\nAccording to the affidavit of Special Agent Daniel R. Genck, a Massachusetts Registry of Motor Vehicles photograph of Dzhokhar Tsarnaev bears a “close physical resemblance” to video images of “Bomber Two,” who was seen near the Boston Marathon Finishing line at the time of the attack.\n The agent continues that the footage reveals the suspect using a cellphone after setting down a knapsack near the blast site.\n“Approximately 30 seconds before the first explosion, he lifts his phone to his ear as if he is speaking on his cell phone, and keeps it there for approximately 18 seconds. A few seconds after he finishes the call, the large crowd of people around him can be seen reacting to the first explosion.”\n The complaint does not elaborate whether Dzhokhar Tsarnaev allegedly used his cellphone to detonate the explosive device, though it describes as “calm” as those around him are in a state of “bewilderment and alarm.”\nOn Monday, during a bedside court hearing in the Beth Israel Deaconess Medical Center Dzhokhar Tsarnaev has been read his Miranda rights by a US judge. He also reportedly told investigators that he and his brother worked alone, and that Tamerlan had organized and led the attacks out of a drive to \"defend\" Islam.\nRead the full transcript of the hearing\nTsarnaev, a naturalized US citizen of Chechen origin who remains hospitalized after sustaining serious injures during the course of his arrest, agreed to \"voluntary detention,\" but declined to answer questions regarding bail, the court record reads. A probable cause hearing – the preliminary hearing which usually takes place before arraignment and before a major crime goes to trial – was set for May 30.\n“Although our investigation is ongoing, today’s charges bring a successful end to a tragic week for the city of Boston, and for our country,” said Attorney General Eric Holder. \"We will hold those who are responsible for these heinous acts accountable to the fullest extent of the law,\" he continued.\nOn Monday, the White House announced that the surviving brother implicated in the deadly Boston Marathon bombing will not be tried as an enemy combatant, but will rather be prosecuted in the federal court system.\n“He will not be treated as an enemy combatant,” White House Spokesman Jay Carney said a media briefing. “We will process this terrorist through our system of justice,” he said.\nNoting that other terrorists had been tried and convicted in federal court, Carny stressed: “The system has repeatedly proven that it can successfully handle the threat that we continue to face.”\nHe continued that as a naturalized US citizen, Tsarnaev cannot be tried before a military commission. Carny added that US President Barack Obama has been and will continue to be updated regularly on the progress of the investigation.\nTsarnaev is being represented by three attorneys from the federal public defender's office.\nFollowing his arraignment, it was earlier reported that Tsarnaev is now awake and responding to investigators’ questions in writing, a law enforcement official not authorized to comment on the matter said.\nThe official, speaking on condition of anonymity, said “substantive” information had been collected during the course of questioning, though he declined to elaborate further, the Detroit Free Press cites him as saying. He further said the neck wounds Tsarnaev sustained may have been self-inflicted, based on the positioning of the entry wound and exit wound.\nAccording to the unsealed indictment, Tsarnaev further suffered gunshot wounds to the head, legs and hand.\n The High-Value Detainee Interrogation Group - a multi-security agency unit tasked with interrogating high-value suspects – had previously been unable to question Tsarnaev following his capture on Friday night due to the extent of his injuries. A primary goal of investigators is to determine if the brothers acted alone and whether there are any unexploded bombs yet to be accounted for.\n Previously, Boston Mayor Thomas Menino expressed his doubts the brothers were part of a larger terror network.\n“All of the information that I have, they acted alone, these two individuals, the brothers,” he said on ABC News’s ‘This Week’.\n Menino had also stated that due the extent of Dzhokhar’s injuries, “we don't know if we'll ever be able to question the individual.\"\n Ruslan Tsarni, an uncle of the accused and his late brother and co-suspect Tamerlan, told the Associated Press that Dzhokhar Tsarnaev had been “used” by his older brother to carry out the bombing. \"He's not been understanding anything,\" Tsarni said. \"He's a 19-year-old boy.\"\n‘Mama, I love you’\n Meanwhile, Anzor Tsarnaev, the father of the two suspected Boston bombers, is set to travel from Russia to the United States to seek “justice and truth.”\n Tsarnaev told AP that he had \"lots of questions for the police\" and he wants \"to clear up many things.\"\n Zubeidat Tsarnaeva, the suspects’ mother, said her husband plans to travel on Wednesday, adding that their family would try to bring the body of their elder son back to Russia.\n Speaking with ABC News, Tsarnaeva recounted her final conversation with her slain 26-year-old son Tamerlan Tsarnaev, which occurred just moments before a deadly standoff with police in the streets of Watertown, Massachusetts, early Friday morning.\n\"The police, they have started shooting at us, they are chasing us,\" Tsarnaeva recalled her son as telling her.\nHe said \"Mama, I love you ” as his mother became frightened and begin to sob and shout. Just as the line cut off, Tamerlan Tsarnaev apparently told his mother that his younger brother was with him.\nHer daughter later called her to tell her that Tamerlan Tsarnaev had been killed.\nOn Monday, Tsarnaev's widow said she learned about her husband’s alleged role in the Boston Marathon bombing by watching TV, the New York Daily News reports.\n After federal investigators visited Katherine Russell Tsarnaev at her parents’ home in Rhode Island, her attorney said he had spoken with authorities and is currently “deciding what we want to do and how we want to approach this.”\nDetails of the fatal standoff emerged on Sunday, beginning on Thursday night when the brothers allegedly ambushed and killed a Massachusetts Institute of Technology police officer, then hijacking a Mercedes-Benz SUV\n The carjack victim, who asked not to be identified, told police that his life was spared because “he wasn’t American,” NBC news reports. According to the criminal complaint, one bomber asked the carjacking victim if he had heard about Monday’s bombings, saying “I did that.” Police believe the pair might have been headed to New York.\n For some time the elder brother drove the carjacked vehicle while the younger brother drove his own Honda. After forcing the victim to withdraw $800 dollars from an ATM, he was later able to escape while the brothers stopped in a convenience store. Police used the victim’s cellphone to track the car, Watertown Police Chief Edward Deveau told ABC.\nThe fierce shootout erupted when the pair was spotted by a Watertown cop, who was told not to approach the suspects until backup arrived.\n\"Unfortunately, they brought their fight to us. They stopped their car because they knew he was behind them. And immediately started shooting at my police officer,\" Deveau said.\nDeveau said they were still attempting to determine the extent of the arsenal used by the brothers.\n“My understanding is that there were firearms and there was a long rifle,\" he said.\n\"Our other officers were responding immediately. They were seconds behind him. So immediately we had three or four Watertown police officers in a gun fight with these two brothers,\" Deveau continued.\n\"At some point they go behind the Honda, open the trunk and start heaving a device at our officers. And there was a huge explosion. We believe that was the pressure cooker bomb that went off. We found the pressure cooker lid embedded into a car further down the street,\" he said.\nThe unsealed indictment also revealed that a 3rd pressure cooker improvised explosive device (IED) was discovered by the FBI in an abandoned car.\nBoston Police Commissioner Edward Davis told CBS's Face the Nation on Sunday that another attack was imminent.\n\"We have reason to believe, based upon the evidence that was found at that scene - the explosions, the explosive ordinance that was unexploded and the firepower that they had - that they were going to attack other individuals,\" he said.\n\"That's my personal belief at this time,\" Davis continued.\nHe said that more than 250 spent rounds of ammunition were found at the scene, and that the ground was \"littered with unexploded improvised explosive devices that we had to point out to the arriving officers.\" Tamerlan Tsarnaev, reportedly got within three meters of police officers before he ran out of ammunition and was tackled. He later died from wounds sustained in the shootout.\nHis injured younger brother Dzhokhar Tsarnaev fled the scene, forcing officers to conduct a house to house search in Watertown. He was arrested late on Friday when he was found seriously injured in a boat in the backyard of a private residence.\n\"He was very slow and lethargic in every move that he made and they could see that there was no device on his chest. They kept creeping closer to him and then they felt it safe enough to pull him away from the boat,\" Deveau continued.\nFBI drops the ball?\n The twin bombing near the finish line of the Boston Marathon last Monday killed three people, including an eight-year-old boy, and wounded up to 183 people.\n Prior to the bombings, neither brother had been flagged by the government as potential terror suspects, nor was there any intelligence that the Boston Marathon might be the target for an attack.\n The FBI confirmed that agents had interviewed Tamerlan Tsarnaev and other family members in 2011 at the request of a Russian intelligence agency but “did not find any terrorism activity, domestic or foreign,” they agency said in a statement on Friday.\n\"There just wasn't anything there,\" said a federal law enforcement official who has been briefed on the matter. \"We ask that the government get back with us if they develop new information, but they did not. The Russians seemed satisfied, so we closed it.\"\n An official further said it would take “some time” before agents are able to review information in the possession of Russian authorities which prompted their request that the FBI look into the activities of Tamerlan Tsarnaev.\n US lawmakers have slammed the FBI for what has been characterized as an intelligence failure, claiming the agency failed to react appropriately to Russia’s warnings.\nHouse of Representatives Homeland Security Committee Chairman Michael McCaul wrote to the FBI and other officials asking why Russia’s request to look into Tamerlan Tsarnaev did not raise red flags at the agency.\n\"Because if he was on the radar and they let him go, he's on the Russians' radar, why wasn't a flag put on him, some sort of customs flag?,\" McCaul, a Texas Republican, said on CNN's ‘State of the Union’ program.\n\"And I'd like to know what intelligence Russia has on him as well.\"\nRepublican Senator Lindsey Graham of South Carolina was more equivocal, saying \"the FBI or the system dropped the ball\" on the elder suspect.\nDemocratic Senator Charles Schumer of New York told the network \"There's certainly a lot of questions\" about the agency’s handling of Tsarnaev.\nWhen asked to address legislators’ concerns, the FBI said it had no further comment beyond Friday’s statement.", "date": "Tue, 23 Apr 2013 04:56:25 GMT", "id": "4835"}, {"title": "Russia says it killed top Islamist insurgent", "url": "http://www.rawstory.com/rs/2013/05/21/russia-says-it-killed-top-islamist-insurgent/", "author": "-", "content": "Like Raw Story on Facebook\nRussia on Tuesday said that a top Islamist rebel, deputy to the country’s most wanted militant Doku Umarov, was killed in an operation in the North Caucasus region, where Moscow is fighting a bloody insurgency.\nDzhamaleil Mutaliyev, who helped organise a 2010 suicide bombing attack in the city of Vladikavkaz, was one of the two people killed in Tuesday’s raid on a residential house in Nazran, the main city of Ingushetiya region that borders Chechnya, the national anti-terrorist committee (NAK) said on its website.\nIt said “Mutaliyev was one of the heads of the insurgency active in Ingushetiya” and a deputy of Doku Umarov, the head of Caucasus Emirate, the militant group that seeks to establish an Islamist state in the region.\nMutaliyev, 37, “was directly responsible for providing terrorists with financial resources, means of military capability, and participated in organising acts of terror with massive death toll,” it said.\nHe was killed along with another man identified as Aliskhan Ozdoyev.\nEarly last year, the NAK said Mutaliyev was killed in another raid, but he was put back on the wanted list in October after being linked to a suicide bombing.\nThe NAK said that Mutaliyev joined the guerrillas in North Caucasus during Russia’s second war in Chechnya in the early 2000s, and was involved in preparing the 2010 suicide bombing at a market in the southern city of Vladikavkaz, which killed 18.\nCaucasus Emirate has claimed several acts of terror in the country, including a bombing in Moscow airport Domodedovo in 2011 that killed 37 people and twin bombings in the Moscow metro in 2010.", "date": "Wed, 22 May 2013 03:40:38 GMT", "id": "9642"}, {"title": "New Details Emerge About The Tsarnaev Brothers’ Time In The United States", "url": "http://boston.cbslocal.com/2013/04/22/new-details-emerge-about-the-tsarnaev-brothers-time-in-the-united-states/", "author": "Joe Shortsleeve", "content": "BOSTON (CBS) – While it is clear the older brother’s personality took an ugly turn in recent years. it is not clear why his younger brother followed him down that path.\nLuis Vasquez of Cambridge says he was a friend of Tamerlan, the older brother. But actually knew both of them. He taught wrestling to his younger brother.\n“He needs to cooperate. We need answers,” Vasquez said.\nStanding a few feet from the bombing sites on Boylston street, Vasquez was sharing his story with national media outlets saying he knew Tamerlan traveled to Russia last year but thought nothing of it.\n“Maybe it is a blessing in disguise that he was eliminated. We have little brother, it is a little weaker. He was not the brain behind this I don’t feel,” he said.\nNot far from Boylston Street, there was extra security outside the Islamic Society of Boston in Cambridge .\nTonight we know older brother Tamerlan was an occasional visitor. And we also know he disrupted a holiday sermon back in January as the speaker was praising Martin Luther King.\nAnwar Kazmi remembered it this way.\n“You know how Martin Luther King has inspired people, just like our Prophet Muhammad has inspired people? He was somehow offended by that he stood up and objected to it,” Kazmi said.\nTamerlan Tsarnaev’s wife, Katherine has also been questioned by federal authorities. She was led out her home in Cambridge, Friday by the FBI. She claims she knows nothing.\nDocuments obtained by WBZ show she was beaten up by her husband in July 2009.\nTamerlan was arrested after he admitted to Cambridge police that he had slapped her.\nWe also know that the mother of the two men lived at the same Norfolk Street address in Cambridge.\nZubeibat Tsarnaev is a licensed cosmetologist in the state of Massachusetts. she apparently worked from the home address.\nWe also know the mother of the two men was arrested in 2012 for shoplifting from Lord and Taylor in Natick.\nPolice say she was caught stealing $1,600 worth of dresses and ruined another $300 worth of dresses by cutting the security tags off them.\nShe recently forfeited her bail when she failed to show up in court.", "date": "Mon, 22 Apr 2013 16:10:08 GMT", "id": "4799"}, {"title": "Jonny Gomes honors Boston Marathon victims with names on his bat", "url": "http://www.latimes.com/sports/sportsnow/la-sp-sn-jonny-gomes-bat-boston-marathon-victims-20130422,0,1750641.story", "author": "Los Angeles Times", "content": "Will Middlebrooks' photo of Jonny Gomes' bat. (Instagram)\nRed Sox outfielder Jonny Gomes honored the victims killed in the Boston Marathon bombings as well as the slain MIT police officer this weekend by having their names etched on his bat.\n Comments are filtered for language and registration is required. The Times makes no guarantee of comments' factual accuracy. Readers may report inappropriate comments by clicking the Report Abuse link next to a comment. Here are the full legal terms you agree to by using this comment form.\nAdvertisement\nEvery show. Every game. Every ticket.\n Be the first on your street to see the show.\nLoading Events...\nMost Viewed\nLatest News", "date": "-", "id": "3684"}, {"title": "-", "url": "-", "author": "-", "content": "-", "date": "-", "id": "4102"}, {"title": "Chechen is not the same as Czech, says Czech government", "url": "http://www.jamaicaobserver.com/news/Chechen-is-not-the-same-as-Czech--says-Czech-government_14116165", "author": "Jamaica Observer Limited", "content": "News\n\n WASHINGTON, US (AFP) — Chechen is not the same as Czech. The Czech Republic is different from Chechnya. That is the simple message that the Czech government wants Americans to know in the aftermath of this week's bombings of the Boston Marathon, allegedly by two brothers of Chechen origin.\n The Czech Republic's ambassador to the United States Petr Gandalovic yesterday felt compelled to clear up what he called a \"most unfortunate misunderstanding\" that some Americans on Twitter have been guilty of in recent days.\n \"The Czech Republic and Chechnya are two very different entities,\" he said in a press release posted on his embassy's website yesterday.\n \"The Czech Republic is a Central European country. Chechnya is a part of the Russian Federation,\" Gandalovic said, one day after police killed one of the alleged perpetrators of the bombing and captured the other.\n Americans are notorious for being geographically challenged, and historically get low scores for their knowledge of the globe.\n Gandalovic said he hoped to clarify that the similarity between Czech and Chechen ends with sound of their names.\n \"The Czech Republic is an active and reliable partner of the United States in the fight against terrorism,\" the envoy said.\n \"We are determined to stand side by side with our allies in this respect — there is no doubt about that.\"", "date": "Sun, 21 Apr 2013 00:00:00 GMT", "id": "3203"}, {"title": "Jack Kingston urged Guard 'take a pass' on Boston Marathon", "url": "http://www.politico.com/story/2013/04/jack-kingston-boston-marathon-90154.html", "author": "Darren Samuelsohn", "content": "A year ago, Rep. Jack Kingston was so concerned about the National Guard’s shriveling budget that he wanted it to “take a pass” on major events like “the Boston Marathon.”\nThe Georgia Republican pleaded with the guard’s leaders to skip participation at the annual race because state-based troops were stressed by the oncoming sequester budget cuts and the need to be in global hotspots like Afghanistan and Bosnia.Continue Reading\nText Size\n - + reset\nBarney Frank 'thankful' for tax money after Boston attacks\nObama: Attack was act of terror\n“The Boston Marathon, we got to take a pass,” Kingston said in March 2012, during a House Appropriations Committee hearing on the National Guard’s budget.\n(PHOTOS: Boston Marathon explosion)\nBut Kingston had a different take on Tuesday as more than 1,000 National Guard troops from Massachusetts and small contingents from New York, New Hampshire and Rhode Island went to work helping Boston and federal officials with their investigation into the bombs that exploded Monday at the marathon’s finish line.\nIn an interview with POLITICO, Kingston, said he still had fiscal concerns about using National Guard troops at the Boston Marathon. But the 11-term congressman, who is now weighing a bid for an open Georgia Senate seat, said he was actually a bit more flexible on the idea of skipping the event entirely, explaining that that’s a decision best left for Massachusetts Gov. Deval Patrick.\n(See also: Full coverage of the Boston Marathon explosions)\n“Any time you’re spending military resources, you want to ask the question of what is the reason you’re putting the resources there? And if the Massachusetts governor determines he needs to do that, then that makes sense,” Kingston said in an interview.\nMore than 460 Massachusetts National Guard troops were on duty Monday at the Boston Marathon before the explosions, helping local police keep the race route clear. On Tuesday, that number ballooned to 1,000 guardsmen to assist with security, bomb disposal, communications and staging buses and helicopters. A small number of troops from Rhode Island, New Hampshire and New York also are working in Boston, or will be soon, according to National Guard Bureau spokeswoman Rose Richeson.", "date": "-", "id": "653"}, {"title": "FBI Agent Kills Florida Man Connected To Boston Bombing Suspect Tamerlan Tsarnaev", "url": "http://www.latinospost.com/articles/19725/20130522/fbi-agent-kills-florida-man-connected-boston-bombing-suspect-tamerlan.htm", "author": "Selena Hill", "content": "BySelena Hill| First Posted: May 22, 2013 12:08 PM EDT\nIbragim Todashev (Photo : Orange County PD)\nThe FBI has confirmed that one of their agents shot and killed a man early Wednesday morning in Orlando, Fla. who may have had ties to one of the suspects in the Boston Marathon bombings.\nAccording toNBC News affliate WESH, a special agent and two Massachusetts State Police troopers were interviewing Ibragim Todashev regarding his connections to the 26-year-old Boston bomber who was shot by police, Tamerlan Tsarnaev. Although he was originally cooperative, the FBI says that he allegedly attacked the agent and was subsequently shot and killed in his apartment near Universal Studios just after midnight.\nLike Us onFacebook\nCBS Newsreports that Todashev was \"someone [the agency was] looking at in connection with Tamerlan [Tsarnaev], based on contacts they had.\"\nIbragim Todashev had also recently traveled to Boston to meet Tsarnaev and he planned a trip to Chechnya, the suspected terrorists' native country.\nKhusn Taramiv, a friend of the suspect, tells NBC News that 27-year-old Ibragim Todashev knew Tsarnaev because both were MMA fighters.\n\"[The FBI] took me and my friend, the suspect that got killed. They were talking to us, both of us, right? And they said they need him for a little more, for a couple more hours, and I left, and they told me they're going to bring him back. They never brought him back,\" Taramiv told WESH.\nTaramiv added that he and Todashev were interviewed for almost three hours last night.\n\"He felt inside he was going to get shot,\" Taramiv said. \"I told him, 'Everything is going to be fine, don't worry about it.' He said, 'I have a really bad feeling.'\"\n\"We are currently responding to a shooting incident involving an FBI special agent,\" FBI Special Agent Dave Couvertier told NBC News. \"The incident occurred in Orlando, Florida. The agent encountered the suspect while conducting official duties. We do not have any further details at this time. We expect to have more information later this morning.\"\n© 2013 Latinos Post. All rights reserved. Do not reproduce without permission.", "date": "Thu, 23 May 2013 00:08:03 GMT", "id": "9720"}, {"title": "BLESSED! Man Survives Boston Marathon Bombing AND Texas Fertilizer Plant Explosion (DETAILS)", "url": "http://globalgrind.com/news/joe-berti-survives-boston-marathon-bombings-texas-fertilizer-plant-explosion-photos", "author": "-", "content": "Two near death experiences in one week. This guy is blessed!\nJoe Berti has been granted the odd privilege of surviving two explosions and being able to tell the tale with no injuries.\nBerti ran in the Boston Marathon early this week in support of a charity that helps children who are suffering from rare or undiagnosed disorders. As he crossed the finish line, his wife cheered him on and the two thought they would celebrate. Instead, two bombs went off, hitting Berti's wife with shrapnel without injuring her and separating the couple. The two later found each other at their hotel.\nReturning back home to Austin, Texas without a scratch, Berti went back to work. On his way home, he saw thick black smoke coming from a fertilizer plant explosion. Berti's initial reaction was \"You've got to be kidding!\"\nBerti tells the Associated Press, \"My next reaction was to get out of there because something fell on the top of my car- some debris or something feel from the sky. It's a miracle. People keep saying, 'Don't you feel unlucky?' and I was actually the opposite.\"\nWow. We're glad Berti and his wife are OK. The man is clearly going to be the family's storyteller this holiday season.\nSOURCE: Gawker | PHOTO: Daily Mail", "date": "-", "id": "930"}, {"title": "No idea on Boston bomb suspects' motive", "url": "http://news.yahoo.com/mass-gov-no-idea-boston-bomb-suspects-motive-135744790.html", "author": "-", "content": "WASHINGTON (AP) — The governor of Massachusetts said Sunday that he has no idea what motivated the brothers accused of exploding two bombs near the finish line of the Boston Marathon.\nSpeaking on CBS' \"Face the Nation,\" Gov. Deval Patrick said it's hard to imagine why someone would deliberately harm \"innocent men, women and children in the way that these two fellows did.\"\nPatrick also said law enforcers believe the immediate threat ended when police killed one suspect and captured the other. The two suspects, Tamerlan and Dzhokhar Tsarnaev, were brothers whose family had come to the U.S. from Russia.\nTamerlan Tsarnaev, 26, was killed in a gunbattle with police Friday. Dzhokhar Tsarnaev, 19, was captured later Friday after being pulled bloody and wounded from a tarp-covered boat in a suburban Boston backyard. He is being guarded by armed officers while he recovers at a Boston hospital.\nThree people were killed and more than 180 injured when two bombs, apparently fashioned out of pressure cookers, exploded Monday about four hours into the race. The brothers are also suspected of killing an MIT police officer and severely injuring a transit officer.\nOn Saturday, Patrick appeared on the field at Fenway Park with dozens of local and state police before the Boston Red Sox's first home game since the bombings. He said the hospitalized suspect was in serious but stable condition and wasn't able to communicate yet.", "date": "-", "id": "1969"}, {"title": "FBI accused of 'dropping the ball' on prior questioning of Tamerlan Tsarnaev", "url": "http://www.guardian.co.uk/world/2013/apr/21/fbi-tamerlan-tsarnaev-questioning", "author": "-", "content": "Members of Congress ask why no flags were raised after FBI was asked to interview elder Tsarnaev brother in 2011\n   Share\n Email\n guardian.co.uk,\nSunday 21 April 2013 11.31 EDT\nTamerlan Tsarnaev in 2010. Photograph: Julia Malakie/AP\nThe FBI was facing increased scrutiny Sunday over its prior handling of a case involving suspected Boston bomber Tamerlan Tsarnaev, with senior congressional figures demanding answers and accusing the agency of \"dropping the ball\".\nAs younger brother Dzhokhar remained in hospital yet to be questioned or charged, Tamerlan – who was killed in a shootout with police early Friday – has been seen by many as the key to understanding how the pair seemingly became radicalised.\nIt is now known that the FBI interviewed the elder Tsarnaev brother in 2011 at the request of the Russian government, which raised concern that he had links to radical Islam. On Sunday rebels in his ethnic homeland of Chechnya denied any link. But a six-month visit to Russia last year is now being scrutinised to see if Tsarnaev did visit any other countries in the North Caucuses region.\nMichael McCaul, Republican chair of the House homeland security committee, told CNN's State of the Union on Sunday that the FBI had questions to answer. \"He was interviewed by the FBI in 2011 and let go. He travelled back to Russia and spent six months there,\" McCaul said.\nOn his return he immediately posted jihadist videos on YouTube, McCaul said. \"Clearly something happened in that six-month timeframe. He radicalised at some point.\" McCaul said he wanted to know why no flags were raised on Tsarnaev that would have helped officials track his movements.\nIt was reported Sunday that a hold was placed on a citizenship request by the 26-year-old as a result of the FBI's previous interest in him. The New York Times claimed officials at the Department of Homeland Security decided not to grant his application after a routine background check uncovered the 2011 interview by agents.\nThe FBI has not said publicly who requested that they look into the activities of the elder brother, but it has been assumed that it was the Russian government. In a statement, the bureau admitted interviewing Tamerlan and other family members. \"The FBI did not find any terrorism activity, domestic of foreign, and those results were provided to the foreign government in the summer of 2011,\" it said.\nOn Sunday, the FBI was accused of having \"dropped the ball\" regarding the older Tsarnaev brother. \"The FBI missed a lot of things is one potential answer, or laws do not allow the FBI to follow up in a sound, solid way,\" a Republican senator, Lindsey Graham, told CNN's State of the Union.\nPeter King, chairman of the House subcommittee on counterterrorism, criticised the FBI. \"This is the firth case I'm aware of where the FBI has failed to stop someone,\" he told Fox News Sunday, going on to cite the cases of al-Qaida recruiter Anwar al-Awlaki, Little Rock shooter Carlos Bledsoe, the accused Fort Hood killer Nidal Malik and alleged American-Pakistani terrorist David Coleman Headley.\n\"This is the latest in a series of cases like this … where the FBI is given information about someone as being a potential terrorist. They look at them, and then hey don't take action and then they go out and commit murders,\" King said.\n   Share            Email\n Hot topics\nEurozone crisis\nLibya\nSyria\nGaza\nUS elections 2012\n   Share", "date": "-", "id": "3048"}, {"title": "Katherine Russell, wife of Boston bombing suspect Tamerlan Tsarnaev, was in the dark about plot: lawyer", "url": "http://www.nydailynews.com/news/crime/wife-boston-bombing-suspect-dark-lawyer-article-1.1323925", "author": "-", "content": "Tamerlan Tsarnaev’s widow says she learned her husband and brother-in-law were the accused Boston Marathon bombers the same way as many Americans: on TV.\n A lawyer for Katherine Russell — wife of dead terror bomber Tamerlane Tsarnaev and mother of his now 3-year-old daughter, Zahara — claims she had no clue her husband allegedly plotted the deadly bloodshed at last week’s Boston Marathon.\n Federal investigators visited the 24-year-old widow Sunday at her parents’ home in North Kingstown, R.I.\n Attorney Amato DeLuca said he spoke with authorities and is now “deciding what we want to do and how we want to approach this.”\n Tamerlan Tsarnaev, 26, died after a shootout with cops early Friday after officials say he and brother Dzhokhar Tsarnaev, 19, fatally shot an officer at the Massachusetts Institute of Technology.\nAn undated photo of Katherine Russell.\nPHOTOS: TWO EXPLOSIONS ROCK BOSTON MARATHON FINISH LINE\n The younger Tsarnaev remains in a Boston hospital, but is unable to speak due to a self-inflicted throat wound.\n Authorities are trying to piece together a motive, and whether the pair had ties to Islamic terror cells.\n The brothers, ethnic Chechens, left Russia with their family in 2002 and became legal residents of the U.S. Dzhokhar later became a naturalized citizen.\n Investigators are focusing on the six months Tsarnaev spent last year in the predominantly Muslim provinces of Dagestan and Chechnya to see if he was radicalized by the militants in the area who have waged a low-level insurgency against Russian security forces for years.\nStew Milne/New York Daily News\nKatherine Russell, front passenger seat, leaves her parents house in North Kingstown, R.I., on Monday. Mother Judith Russell is driving.\n The suspects’ parents moved back to Russia.\nRELATED: BOSTON BOMBING BROTHERS WERE HEADED FOR NY?\n Their aunt, Patimat Suleimanova, who wore a pea-green headscarf, said her nephew prayed regularly and studied the Muslim holy book. “He needed this. This was a necessity for him,” she said.\n Every day, using Skype, he spoke to his American-born wife, who had recently converted to Islam, and at times she instructed him on how to observe religious practices correctly when he lapsed, Suleimanova said Sunday from her home in Makhachkala, the capital of Dagestan.\n She said her nephew was considering bringing his wife to Dagestan.\nWPRI\nThe North Kingstown, R.I., family home of Katherine Russell, 24, who was married to and had a child with the marathon bombing suspect Tamerlan Tsarnaev. He was fatally wounded in a police shootout early Friday.\n Russell’s deep connection with Islam is a stark change from her New England upbringing.\n Former school friends told the Daily Mail that Russell, the oldest of three daughters, was raised Christian by her parents, a doctor and nurse. She once had dreams of entering the Peace Corps.\nPHOTOS: INSIDE THE MANHUNT FOR BOSTON MARATHON BOMBING SUSPECTS\n At North Kingstown High School, she was a member of the art club, dance team and took part in wacky “mismatched/bad hair days,” according to the Mail.\n In her high school yearbook, she chose the quote, “Don’t take anything for granted.”\nJulia Malakie/The Lowell Sun/AP\nTamerlan Tsarnaev (l.) accepts the trophy for winning the 2010 New England Golden Gloves Championship in Lowell, Mass. Tsarnaev, 26, was known to the FBI as suspect no. 1 in the Boston Marathon explosions.\n “She was just this all-American girl who was brainwashed by her super-religious husband,” said one unidentified friend.\n “None of us would have dreamed that she would marry so young or drop out of college and have a baby or convert or be part of any of what’s happened,” the former classmate added. “She’s just not the same person at all.”\n DeLuca said Russell met Tsarnaev, an ex-Golden Gloves boxer, through friends while she was attending Suffolk University in Boston. They married in 2009 or 2010, and she never graduated.\nRELATED: INVESTIGATORS LOOKING INTO SUSPECT’S TIME ABROAD IN RUSSIAN CAUCASUS REGION\n Tsarnaev was arrested in July 2009 for violently assaulting Russell, according to the Mail. She later told Cambridge cops that he was “a very nice man.”\nFBI.gov\nBrothers Dzhokhar (l.) and Tamerlan Tsarnaev (r.) near the finish line of the Boston Marathon, where authorities say the pair set off two homemade bombs, which killed three people and injured more than 180.\n At some point, she converted to Islam for him.\n “She believes in the tenets of Islam and of the Koran,” DeLuca said. “She believes in God.”\n Russell was working full-time seven days a week as a home health care aide while Tsarnaev cared for their child, DeLuca added.\n “When this allegedly was going on, she was working, and had been working all week to support her family,” he said.\nRELATED: WIFE'S FAMILY OF ALLEGED BOSTON BOMBER EXPRESS SHOCK AFTER HIS DEATH\n© Allison Joyce\nTamerlan Tsarnaev's house in Cambridge, Mass.\n On Thursday, the last day Tsarnaev was alive, Russell noted that her husband “was at home,” DeLuca said.\n The Russell family has spoken with investigators. In a statement Friday, they said Tsarnaev wasn’t the man they believed him to be.\n “In the aftermath of the Patriots’ Day horror we know that we never really knew Tamerlan Tsarnaev,” they said. “Our hearts are sickened by the knowledge of the horror he has inflicted.”\n With News Wire Services\n eortiz@nydailynews.com\n ON A MOBILE DEVICE? CLICK HERE FOR VIDEO", "date": "-", "id": "4786"}, {"title": "Putin Wins, Obama Loses in Boston Extremism", "url": "http://www.forbes.com/sites/paulroderickgregory/2013/04/23/putin-wins-obama-loses-in-boston-extremism/", "author": "Paul Roderick Gregory", "content": "US President Barack Obama (R) listens to Russian President Vladimir Putin during a bilateral meeting in Los Cabos on June 18, 2012 . (Image credit: AFP/Getty Images via @daylife)\nPundits tut-tutted when a left-wing publication (see Salon.com) hoped out loud that white, anti-tax, domestic terrorists perpetrated the Boston marathon massacre. They had reason to hope: Wouldn’t backwoods, pick-up-truck radicals pick tax day for their strike?  What a disappointment to learn that the terrorists were young Muslim devotees of extremist web sites.\nSuch a liberal Wunschtraum was indeed in bad taste, but terror incidents do have political consequences, sometimes vast; so why shy away from discussing them?\nThe Oklahoma City bombing by white anti-government terrorists resuscitated a faltering Clinton presidency. George Bush’s performance at the ruins of the World Trade Center in the immediate aftermath of 9/11 was the high point of his presidency.\nBoston extremism should plague Barack Obama throughout his second term as it raises legitimate question about his handling of the war on terror. It will help Vladimir Putin remove the last vestiges of democracy and free press from his totalitarian Russia without a peep from the U.S.\nThe Boston Marathon attack undermines Obama’s claimed foreign-policy achievement (“I killed Osama and Al Qaeda is on the run.”) on which he based his campaign. A newsman as respected as Tom Brokaw refuted Obama in clear words (on Meet the Press) that could not be misunderstood: “With the death of Osama Bin Laden, Islamic rage did not go away. In fact, it is in some ways more dangerous.”\nImagine the effect of a Brokaw making such a statement on the eve of the election, but Obama no longer has to face the electorate. He is home safe.\nAt a more fundamental level, Boston extremism calls into question Obama’s treatment of Islamic extremism with excessive sensitivity, sympathy, and understanding. If we can understand the root causes of Islamic terror and recognize our own fault in the matter, we can them win over, Obama appears to believe. We must be slow to blame and not offend Muslim sensitivities. A Muslim-American army psychiatrist who shoots fellow soldiers with the cry “Allah is great” must have been mistreated or suffer from mental problems. His ties with a radical Muslim preacher are just coincidence. The Obama administration asked us to believe that the fatal attack on our Benghazi consulate was by an unorganized mob enraged by an anti-Islam film. Also we must not mistreat suspected Islamic terrorists once in custody as did his insensitive predecessor (but we can kill them with drone strikes from the air).\nBoston extremism raises entirely legitimate questions about the Obama administration’s handling of the war on terror.  Over the past four years, tales of plots and conspiracies thwarted by an almost infallible security team lulled us into a sense of security. Boston suggests this was either exaggeration or simply good luck.\nVladimir Putin is an entirely different story. He gets a windfall from Boston extremism. When President Obama telephoned Putin to thank him for his cooperation, it should have been Putin thanking Obama for boosting him both at home and abroad.\nPutin wants to use the Boston massacre to suggest to America and the rest of the world that it is he, Putin, who vigilantly guards the front line against Islamic terrorism in Chechnya. He would like to use the Chechen brothers’ killing of innocent people in Boston to show what he is up against in the North Caucasus and why his troops and proxies have, at times, gone over the line of torture, murder, and bombing of civilians. (Estimates place Chechen civilian casualties between 50,000 and 200,000 in a population of 1.2 million).\nThe Chechen origin of the Boston bombers gives Putin a freer hand to deal brutally and mercilessly with opponents/terrorists in Chechnya and move against the few human rights advocates left in Russia willing to take up the cause of atrocities on Chechen civilians.\nThe timing of the Boston marathon slaughter also could not have been more propitious for Putin. Over Obama’s objections, Congress’s just released its “Magnitsky List” of Russian human-rights abusers denied U.S. visas. Three officials on the list were charged with atrocities in Chechnya.\nI would imagine that Putin may have wanted to vent to Obama more during their phone conversation. He has publicly suggested that Obama deep-six the Magnitsky List and has opined that Western journalists stop complaining about the unsolved murder of investigative reporter Anna Politovskaya.\nMost of all, Putin wants the world to view Chechnya as part of the war against Islamic terror, not as the brutal suppression of an independence movement that has legitimate grievances. He does not want outsiders to know that Chechen nationalists fight for national independence, not against Christian crusaders or for a new caliphate.\nChechnya did not become interested in independence just recently. Chechens used their mountainous terrain and fierce warriors to remain free of the Tartar Yoke from the thirteenth to the fifteenth centuries and was the last independent region incorporated into the Russian Empire . Chechens paid a stiff price for their nationalism in the Soviet period. From the late 1930s through World War II, Stalin deported Chechens as traitors to Soviet power.\nAs in Syria, the Chechen picture is a mixed one. The invasion of a Muslim republic by “Christian” Russian forces naturally attracted extremists to Chechnya (and has provided international extremism with warriors, now including the Tsarnaev brothers).\nWhile Putin fights an independence movement, which he wants us to interpret as a war against Islamic terrorism, the United States battles the fundamentalist Islam of Al Qaeda, and its numerous branches, offshoots, and copycats. Putin has shown a lack of interested in joining the general fight against Islamic extremism. He just wants the world to give him a free hand – under the pretext that he is fighting against Muslim terrorists — to complete his destruction of the Chechen independence movement.\nPutin is the anti-Obama with respect to his brutal treatment of Chechen Muslims: In his first days in power, Putin publicly blamed Chechen terrorists for bombing civilian apartment houses even though evidence pointed to his own security forces. Putin’s scorched earth attack left a Chechnya of ghost cities and towns and tens of thousands of Chechen civilians dead. Journalists investigating horrible atrocities against Chechen civilians were taken out by professional killers, who remain unpunished. Putin did not restrain his skin-head Nashi hooligans, when they targeted dark skinned people on the streets. Putin has made the cooperative Russian Orthodox Church the state religion, leaving little room for Russia’s massive Muslim population.\nWe are in the early stages of understanding what happened in Boston. We will surely find out because the mayhem and carnage of Boston played out in full view of a world that will demand answers. The Chechen link has given Putin a prize that he will exploit to the last drop. Obama, on the other hand, must rebut the charges that will surely come that his war on terror has not been the success he claimed it was.", "date": "Mon, 18 Jun 2012 00:00:00 GMT", "id": "5467"}, {"title": "Boston Marathon bombing suspects' sister holed up in West New York, New Jersey home", "url": "http://abclocal.go.com/wabc/story?section=news/national_world&id=9072306", "author": "-", "content": "WEST NEW YORK, New Jersey --  A sister of the Boston Marathon bombing suspects was holed up in her northern New Jersey home on Saturday, as she worked through her grief and considered addressing the allegations against her brothers.\n Police continued to stand guard at the West New York apartment building where Ailina Tsarnaeva lives with her husband and baby, and authorities say officers will remain at the site indefinitely for her protection.\n West New York Police Director Michael Indri spoke briefly with Tsarnaeva inside her apartment Saturday. Upon leaving the three-story building, he told reporters she was grieving and appeared to have been crying.\n \"She's grieving, grieving, grieving for her family and for this whole horrific ordeal, for the people as well,\" Indri said.\n Indri also said Tsarnaeva is considering making a statement in the coming days, but it's unclear when that may happen.\n Tsarnaeva told federal agents on Friday she had not been in contact with her brothers for years. They removed a computer, electronics and other items from the apartment.\n Her brother Tamerlan Tsarnaev, 26, was killed in a shootout with police outside Boston. Her younger brother, Dzhokhar, was taken into custody Friday evening after a manhunt that left the Boston metropolitan area nearly paralyzed.\n On Friday, she spoke through a barely open door to News12 New Jersey and The Star-Ledger, telling them she was sorry for the families that lost loved ones \"the same way I lost my loved one.\"\n \"He was a great person,\" the woman said of her dead brother. \"I thought I knew him. I never would have expected that from him. He is a kind and loving man. The cops took his life away just the same way he took others' lives away, if that's even true. At the end of the day, no one knows the truth.\"\n PHOTOS:\n Friday manhunt and lockdown in Boston\n Surveillance photos of the bomb suspects\n Pictures from the Boston Marathon bombings\n ---\n (Copyright ©2013 by The Associated Press. All Rights Reserved.)\nGet more U.S. & World News »\nTags:boston marathon bombings, boston marathon explosions, dzhokhar a. tsarnaev, tamerlan tsarnaev, boston, cambridge, watertown, boston marathon, explosion, u.s. & world news", "date": "Sat, 20 Apr 2013 00:00:00 GMT", "id": "1603"}, {"title": "FBI Hasn't Interviewed Tamerlan Tsarnaev's Widow Yet", "url": "http://www.slate.com/blogs/the_slatest/2013/04/22/katherine_russell_tsarnaev_tamerlan_tsarnaev_s_wife_hasn_t_spoken_with_police.html", "author": "Josh Voorhees\nJosh Voorhees", "content": "Federal authorities are still waiting to interview Katherine Russell Tsarnaev, the wife of Tamerlan Tsarnaev and the mother of his 3-year-old daughter. Her lawyer tells the Associated Press that officers showed up at the Rhode Island home of her parents Sunday night but she declined to speak with them. \"I spoke to them, and that’s all I can say right now,\" attorney Amato DeLuca said before going on to paint the latest brush strokes in the still-developing picture of Tamerlan Tsarnaev in the days before the Boston Marathon bombing. Here's the Associated Press with the relevant details:\nDeLuca also offered new details on Tamerlan Tsarnaev’s movements in the days after the bombings, saying the last day he was alive that ‘‘he was home’’ when his wife left for work. When asked whether anything seemed amiss to his wife following the bombings, DeLuca responded, ‘‘Not as far as I know.’’ He said she learned her husband was a suspect in the bombings by seeing it on TV. He would not elaborate.\nDeLuca said his client did not suspect her husband of anything, and that there was no reason for her to have suspected him. He said she had been working 70 to 80 hours, seven days a week as a home health care aide. While she was at work, her husband cared for their toddler daughter, DeLuca said. \"When this allegedly was going on, she was working, and had been working all week to support her family,’\" he told the AP.\nAccording to DeLuca, Katherine Russell Tsarnaev, now 24, was a student at Suffolk University in Boston when her friends first introduced her to Tamerlan at a nightlclub. They then dated on and off again before marrying in either 2009 or 2010, he said. At some point she converted from Christianity to Islam.\n***Follow @JoshVoorhees and the rest of the @slatest team on Twitter, and read more on Slate about the Boston Marathon bombing.***", "date": "", "id": "4979"}, {"title": "Boston Marathon explosion: Day 2", "url": "http://www.washingtonpost.com/blogs/early-lead/wp/2013/04/16/boston-marathon-explosion-live-updates/", "author": "-", "content": "", "date": "Tue, 16 Apr 2013 00:00:00 GMT", "id": "239"}, {"title": "Amy Poehler Lays Off The Laughs To Reflect On The Boston Marathon Bombings!  Watch HERE!", "url": "http://perezhilton.com/2013-04-21-amy-poehler-ask-amy-video-response-boston-marathon-bombings", "author": "-", "content": "Ohhh boy! This is a DOOZY!\nReese Witherspoon and her husband, Jim Toth, were reportedly arrested and put into jail early Friday morning in Atlanta, Georgia, after the CAA agent was pulled over for driving while intoxicated!\nHowever, while HE alone is facing the DUI charge, it's the Hollywood starlet whose looking at some serious trouble, as she was ARRESTED separately for disorderly conduct!\nThat's right! Gurlfriend was NOT happy with the situation at hand, and despite repeated instruction to stay inside her car, she could not do as she was told and was eventually handcuffed!\nAccording to reports, Toth\nRead more »\n[Image via WENN.]", "date": "-", "id": "1290"}, {"title": "Ray Kelly Talks Lessons Of Boston Marathon Bombings", "url": "http://newyork.cbslocal.com/2013/04/22/ray-kelly-talks-lessons-of-boston-marathon-bombings/", "author": "-", "content": "NEW YORK (CBSNewYork) - As we mark the one week anniversary of the deadly bombing at the Boston Marathon, New York City Police Commissioner Ray Kelly is speaking out about how our city can learn from what happened up there.\n“Well, we certainly want to talk to the Boston authorities, the FBI, and see what their lessons learned are,” Kelly told WCBS 880′s Michael Wallace and Pat Carroll.\nKelly said he wants to expand the number of mobile cameras in the city.\n“We want to be able to put cameras up at certain events, take them down, and put them up to cover other events,” Kelly said.\nRay Kelly On Boston Marathon Bombings He spoke with WCBS 880's Michael...\nHe said that was something that had been under discussion, but the events in Boston could make it happen faster.\nKelly was asked about what he thought of the police work done in Boston.\n“I thought it was excellent work and, particularly, in an area like that, where you have multiple jurisdictions. You have, obviously, the FBI, the Boston Police, the Watertown Police, the Cambridge Police, you had the transit police force that was involved. So, it all seemed to work very well,” he said.\nKelly was also asked about the lessons learned from 9/11.\n“Well, I can tell you, obviously, we’ve learned an awful lot in this city. We’ve invested more than any other city that I’m aware of in protecting ourselves from a terrorist attack and a lot of other jurisdictions come here. They look at what we’ve done. Some of the things they may see helpful. Some they may not. Every city is different,” he said. “A lot of lessons were learned on 9/11, but we certainly can’t stop learning. We have to examine what happened in Boston and really see if we can improve what we’re doing here.”\nAs the NYPD looks at how it can improve the ways it secures the city, the MTA is relaunching its “see something, say something” ad campaign.\nThe MTA’s award-winning security awareness campaign will appear on television and in print this month.\nThe new round of ads depicts what appear to be potential terrorists planting bags on subways, buses, and trains.\nPrior ads portrayed images of unattended packages in transit facilities.\nThe Department of Homeland Security is funding the $10 million campaign.\nOn Monday, Mayor Michael Bloomberg also said that New York City officials will be speaking with those in Boston to learn as much as possible.\n“Put that into the database and into our thoughts about what kind of protection we should provide and when it’s appropriate,” Bloomberg said.\nHe said security procedures will have to be tightened.\n“We have to understand that in the world going forward, we’re going to have more cameras and that kind of stuff,” he said.\nThe mayor was cautious about ramping up security too much.\n“What we can’t do is let the protection get in the way of us enjoying our freedoms,” he said.\nDespite the dangers in the world, Bloomberg said he thinks the city is as safe as it’s ever been.", "date": "-", "id": "3668"}, {"title": "Boston Marathon Explosions USA TODAY", "url": "http://www.usatoday.com/topic/3866dc7c-a99b-426d-84bc-84fd84d819d2/boston-marathon-explosions/", "author": "Usa Today", "content": "", "date": "-", "id": "786"}, {"title": "Chechen Conflict Spawned Terrorism With Separatist Jihad", "url": "http://www.bloomberg.com/news/2013-04-21/chechen-conflict-spawned-terrorism-with-separatist-jihad.html", "author": "Ken Fireman", "content": "The Northern Caucasus region of Russia has become an incubator of Muslim extremism amid the convulsions of a separatist conflict in Chechnya that killed tens of thousands of people, turned hundreds of thousands into refugees and sent embittered exiles across the globe.\nTwo ethnic Chechens -- one dead, the other in custody -- are suspects in the April 15 Boston Marathon bombings that killed three people and injured more than 170. Dzhokar Tsarnaev was captured on April 19 after a day-long manhunt and a confrontation with police in which his brother, Tamerlan, was killed.\nThe family’s ancestral home is in Chechnya, and Tamerlan visited relatives there in 2012 during a half-year stay in Russia spent mostly in the neighboring republic of Dagestan, an aunt, Patimat Suleimanova, told reporters. An uncle, Ruslan Tsarni, also told reporters they were ethnic Chechens.\nWhile Chechen separatists and their supporters have taken credit for several terrorist attacks in recent years, none took place outside the borders of Russia. An attack in the U.S. would be a first, according to Christopher Swift, a professor of national security studies at Georgetown University in Washington who has studied the insurgency.\n“That is a big deal,” Swift said in an April 19 interview. “They haven’t attacked U.S. targets before because they’ve always been focused on Russia and gaining independence from Russia. To the extent they’ve ever cared about the United States, it’s been rhetorical and ideological, but never operational. This would change that.”\nMotivation Unclear\nIt isn’t yet clear what motivated the Tsarnaev brothers. Tamerlan spent most of his six months in Dagestan reading the Koran, according to his aunt, and the FBI said in a statement that he was brought to its attention two years ago by a foreign government concerned that he held extremist Islamic beliefs. A U.S. law enforcement official identified the government as Russia.\nYet the FBI said it had found no evidence at that time of Tamerlan engaging in terrorist activity, and his uncle said he believed the brothers’ actions had “nothing to do with Chechnya.” An Islamic rebel group based in the Northern Caucasus denied any link to the Boston bombings and said its fight was directed against Russia, not the U.S.\nAlvi Karimov, a spokesman for Chechen President Ramzan Kadyrov, said last week the brothers “weren’t born, raised, taught or somehow shaped in the Chechen republic” and that the roots of their actions were to be found “in the place they rose and studied -- in the U.S.”\nConflict’s Origins\nThe Chechen conflict began almost two decades ago as an attempt by the majority Muslim republic to break away from Moscow’s control in the backwash of the Soviet Union’s collapse. The rebellion veered in an Islamic-extremist direction when Russian troops returned to Chechnya after a brief hiatus in 1999.\n“It started as a Chechen nationalist movement, and as the second Chechen war dragged on, it became a radical Salafist movement,” said Swift, referring to an ultra-orthodox form of Islam. “They were democratic Islamists at the beginning, but the second Chechen War radicalized the rebel movement in profound and disturbing ways. They came to adopt the ideology of the global jihad movement.”\nThe originally secular movement shifted toward Islamic radicalism when its leaders saw that as a path to support from the Muslim world in the form of money and fighters, said Svante Cornell, a researcher at Johns Hopkins University’s School of Advanced International Studies in Washington who has studied the Caucasus and Central Asia.\n‘Be Cool’\n“That some young Chechnyans who were initially motivated by local concerns got sucked up in global issues that have nothing to do with the original concerns makes a lot of sense,” Cornell said in a phone interview. “You know how people who are trying to be cool in the West wear a Che Guevara T-shirt? To be cool in Chechnya, you wear a Bin Laden T-shirt.”\nThe conflict began in December 1994 when Russian army forces entered the republic to suppress a bid by its political leaders for independence. After an uneasy truce from 1996 to 1999, it flared again when then-Prime Minister Vladimir Putin ordered Russian troops back into Chechnya following a string of bombings in Russian cities that Putin attributed to Chechens.\nEstimates of those killed and exiled in the conflict have varied widely. A 2010 background report on Chechnya by the Council on Foreign Relations concluded that “tens of thousands of Chechens and Russians were killed or wounded in the two wars, and hundreds of thousands of civilians were displaced.”\nCapital Destroyed\nThe Chechen capital of Grozny was devastated by fighting in 1994-95 and again in the conflict that started in 1999. Russian forces seeking to dislodge separatists from the city in 1995 used long-range bombing and shelling to attack rebel strongholds, often leveling surrounding structures as residents cowered in basements.\nThe U.S. government has accepted the principle of Russian sovereignty over Chechnya and the rest of the Northern Caucasus while criticizing what it says are human rights abuses committed by Russia and its local partners in suppressing the separatists.\nIn its annual human rights report for 2012, issued last week, for example, the State Department said cited reports from Russian human rights groups that security forces in both Chechnya and Dagestan were guilty of abducting suspected rebels, using indiscriminate force to detain people and torturing those arrested.\nRebel Switched\nThe republic has been relatively quiescent in recent years after Kadyrov, once a rebel, switched sides and brutally asserted control over Chechnya with Russian support. Kadyrov’s father, Akhmad, who was assassinated in 2004, began the process of pacifying Chechnya.\nAt the same time, some separatists turned to terrorism. An attack by militants on a school in Beslan, North Ossetia, another republic in the Northern Caucasus, in September 2004 left 350 people dead, half of them children.\nChechen insurgents also carried out an attack on Moscow’s Dubrovka Theater in October 2002, a hostage-taking that resulted in 130 fatalities when Russian forces attempted a rescue operation.\nA suicide bombing at Moscow’s Domodedovo Airport, the busiest air hub in Russia, killed at least 37 people in January 2011. A year earlier, twin suicide subway bombings during the morning rush hour in the Moscow subway killed 40 people.\nChechen militant leader Doku Umarov claimed responsibility for both the Domodedovo attack and the subway bombings. Russian authorities have linked Umarov to a foiled plot to attack the Sochi 2014 Winter Olympics, which they say they uncovered last year.\nPutin, who was elected president of Russia in 2000 in part on the popularity he gained from unleashing the second Chechen war, vowed last year to combat Islamic extremists.\nTo contact the reporters on this story: Ken Fireman in Washington at kfireman1@bloomberg.net Henry Meyer in Moscow at hmeyer4@bloomberg.net\nTo contact the editor responsible for this story: Cesca Antonelli in Washington at fantonelli@bloomberg.net\n Enlarge image\nDzhokar Tsarnaev, one of the suspects in the Boston Marathon bombing, is shown in an undated handout photo provided by the FBI to the media on Friday, April 19, 2013. Source: FBI via Bloomberg\n April 21 (Bloomberg) -- A helicopter equipped with a thermal camera captures video of Boston Marathon bombing suspect Dzhokar Tsarnaev hiding in a boat stowed in the back yard of a home in Watertown, Massachusetts, on April 19. The suspect was taken into custody after an almost 24-hour manhunt that shut down Boston and surrounding cities. Video courtesy of Massachusetts State Police. (Source: Bloomberg)\n Enlarge image\nThis file photo from February 2010 shows now-deceased Boston Marathon bombing suspect Tamerlan Tsarnaev, who had been brought to the attention of the Federal Bureau of Investigation two years ago by a foreign government concerned he held extremist Islamist beliefs. Photographer: Julia Malakie/The Lowell Sun via AP Photo\n Enlarge image\nAn undated file photo released to Bloomberg by a family aunt shows Tamerlan Tsarnaev, top center, and Dzhokar Tsarnaev, bottom center, posing with their sisters at an undisclosed location. Source: Family photo via Bloomberg", "date": "-", "id": "3173"}, {"title": "Error Page", "url": "http://www.theaustralian.com.au/opinion/world-commentary/teen-migrants-clinging-to-a-torn-identity/story-e6frg6ux-1226626209774", "author": "-", "content": "An error (302 Moved Temporarily) has occured in response to this request.", "date": "-", "id": "7815"}, {"title": "Boston bomb sicko had party", "url": "http://www.thesun.co.uk/sol/homepage/news/4896651/Boston-bomber-party.html", "author": "-", "content": "THE evil teen captured in a manhunt that gripped the world PARTIED after bombing the Boston Marathon, it emerged yesterday.\n Dzhokhar Tsarnaev, 19, let his hair down with pals after he and his brother left three dead and 176 injured.\n He proudly tweeted before the bash how he felt “stress-free” and ready to celebrate — as America reeled in horror at the dead and maimed.\n A girl who went to the college soccer party in Boston two days after Monday’s carnage said of the Russian Muslim, whose family hail from Chechnya: “He was just relaxed.”\n Twitter fan Tsarnaev also posted rap lyrics — as he crowed: “I’m a stress-free kind of guy.”\n He sickeningly tweeted: “Ain’t no love in the heart of the city, stay safe people.”\n The teenager slept in a single room in the dorm of the University of Massachusetts-Dartmouth, where he was said to have been studying medicine.\n Two days after the marathon carnage he was happily working out at the gym there.\n Last night the wounded fugitive — found in a boat on a trailer in a suburban garden — was under guard in hospital too ill to be quizzed by the FBI.\nBoston Marathon bombers ... the Tsarnaev brothers\n His elder brother Tamerlan was yesterday revealed to have been briefly probed by the FBI in 2011 after a tip-off from Russian intelligence. But nothing untoward was found.\n'Relaxed' ... Dzhokhar Tsarnaev\n Yesterday their mum claimed the pair had been framed by the FBI, who had watched them for up to FIVE years.\n They came to the US from Russia ten years ago, but the motive for their rampage remained a mystery last night. Their uncle Ruslan Tsarni said Tamerlan, 26, became “radicalised” by an Islam convert four years ago.\n Cousin Zaur Tsarnaev, 26 — speaking back in Makhachkala, Russia — said the younger sibling was in thrall, adding: “I used to warn Dzhokhar that Tamerlan was up to no good.”\n Last night Massachusetts governor Deval Patrick said of wounded Dzhokhar: “We hope he survives. We have a million questions.”\n TAMERLAN had wounds “from head to toe” after the gun battle, a medic at the hospital where was pronounced dead said last night. Dr David Schoenfeld added: “Every region of his body had injuries.”", "date": "Sun, 21 Apr 2013 00:00:00 GMT", "id": "1784"}, {"title": "Dzhokhar Tsarnaev Is Finally Answering Questions But His Answers May Be Unsatisfying", "url": "http://thestir.cafemom.com/in_the_news/154456/dzhokhar_tsarnaev_is_finally_answering", "author": "-", "content": "Boston Marathon bombing suspect Dzhokhar Tsarnaev has been in the hospital since last Friday's horrific ordeal and his hours on the run in Boston. Although Tsarnaev was taken alive, because of a reportedly self-inflicted gun shot wound to his throat, he has been unable to answer questions.\nIn fact, some were implying that he may never talk to investigators. Luckily, that doesn't seem to be the case and the injured 19-year-old is now answering questions, albeit doing so in writing. As yet there is no indication that the information he is giving is helpful.\nStill, it's the first hope that we might finally get some answers as to why this kid everyone described as \"nice\" and \"normal\" and \"cool\" would have taken such a radical turn and hurt and killed so many people in the Boston Marathon bombings.\nStill, we may never get the answers we seek.\nThe reality is, he can choose what to answer and what not to answer, and since he appears to be in uncharted territory, who knows how it will all play out. This is a kid who was described as nice and kind and fun and a pothead by many friends.\nThe speculation is that his brother Tamerlan Tsarnaev radicalized him and that he is the influence that turned Dzhokhar from a fun-loving, cool guy to a suspected killer.\nMore from The Stir: 12 New Questions About the Tsarnaev Brothers Answered\nIt's truly a tragedy in so many, many ways. What a waste of so many promising lives, the younger bomber included. All he had to do was keep doing what he was doing and he might have actually been a success story. Instead he is suspected of killing four innocent people (three in the bombing and then the MIT officer who was shot to death) and permanently maiming so many more.\nHow could he?\nThat is the question we all want to know. But maybe we never will. Maybe people really never are what they seem, and the best we can hope for is some kind of irrational, illogical rambling about why they do what they do.\nThere is no rational way to explain going from a 19-year-old college kid to a child murderer. There is nothing he will say that will make our country less angry or less full of grief. There simply is no answer.\nDo you think Dzhokhar will ever tell us the truth?\nImage via Boston Police Department", "date": "-", "id": "3767"}, {"title": "The New Online Craze", "url": "http://www.thehollywoodgossip.com/2013/05/dzhokhar-tsarnaev-fan-sites-conspiracy-theories-the-new-online-c/", "author": "Free Britney", "content": "Dzhokhar Tsarnaev has a growing fan base on Tumblr apparently.\nUp until last week, \"One Direction Infection\" was a Tumblr blog created and maintained by an eighth grader devoted to the British boy band heart throbs.\nNow, it's devoted to the Boston Marathon bombing suspect.\nJahar, as Dzhokhar Tsarnaev's friends and Twitter followers call him, has amassed a pretty huge following for a man charged withterrorism and WMD use.\nHe has his own hashtag, #FreeJahar, on Twitter, while thousands of Tumblr and Facebook fans closely follow his case and discuss his \"innocence.\"\nBeyond the boilerplateBoston bombing conspiracytheories that claim he's the fall guy or the whole thing is a hoax, there are other reasons for his appeal.\n\"I do believe he is very cute, but that’s not the reason I'm involved in this movement,\" the aforementioned 1D turnedFree Jahar Tumblr owner told Gawker.\n\"I am in this because I don’t believe its right to put a totally innocent person in jail for the rest of his/her life or even death penalty. I don’t care who it is, it just isn’t fair.\"\nBy any measure, #FreeJahar is a bizarre expansion of \"fandom\" culture - rabid communities of admirers, usually young women, that organize themselves online.\nExchanging photos, fan art and writing, their near-undefinable flood of emotion and desire is palpable. In this case, it can also be political and viral.\nFor the most part, #FreeJahar believers' Tumblr pages are image-heavy and mock the \"perception\" of Dzhokhar Tsarnaev as a terrorist or criminal.\nThey are conspiratorial (\"If you believe the official story regarding Boston, I don’t know what to tell you\"), yet, in the majority of cases, blatantly juvenile.\nIt's hard to tell exactly how many people believe in Tsarnaev's innocence, or how strongly. But there's no doubt that the \"movement\" is growing fast.\nOn Tumblr, there are a dozen or so dedicated #FreeJahar blogs, and scores of allies and sympathizers who \"like\" and \"reblog\" their posts loyally.\nOn Twitter, Tsarnaev's friends, many of whom have embraced #FreeJahar, have thousands of followers, while pro-Jahar Facebook pages are heavily \"Liked.\"\nIt's hard to say what possesses someone to become involved in such activity, but the Jahar loyalists aren't alone. James Holmes has online fans too.\nSeriously.", "date": "-", "id": "9286"}, {"title": "Boston suspects' father postpones trip to US", "url": "http://news.yahoo.com/boston-suspects-father-postpones-trip-us-124041600.html", "author": "Arsen Mollayev", "content": "MAKHACHKALA, Russia (AP) — The father of the two Boston bombing suspects said Sunday that he has postponed a trip from Russia to the United States because of poor health.\n\"I am really sick,\" Anzor Tsarnaev, 46, told The Associated Press. He said his blood pressure had spiked to dangerous levels.\nTsarnaev said at a news conference Thursday that he planned to leave that day or the next for the U.S. with the hope of seeing his younger son, who is under arrest, and burying his elder son, who was killed. His family, however, indicated later Thursday that the trip could be pushed back because he was not feeling well.\nTsarnaev confirmed on Sunday that he is staying in Chechnya, a province in southern Russia, but did not specify whether he was hospitalized. He is an ethnic Chechen and has relatives in Chechnya, although he and his family spent little time in Chechnya or anywhere else in Russia before moving to the U.S. a decade ago.\nHe and the suspects' mother, Zubeidat Tsarnaeva, returned to Russia last year and settled in Makhachkala, the capital of neighboring Dagestan, where Tsarnaeva's relatives live.\nDuring the past week, they were both questioned extensively by U.S. investigators who had traveled to Makhachkala from Moscow. They also were besieged by journalists who staked out their home.\nTsarnaev's family said last week that he intended to get to the U.S. by flying from Grozny, the Chechen capital, to Moscow. He and Tsarnaeva left Dagestan on Friday, but their whereabouts were unclear.", "date": "-", "id": "6280"}, {"title": "The New Online Craze", "url": "http://www.thehollywoodgossip.com/2013/05/dzhokhar-tsarnaev-fan-sites-conspiracy-theories-the-new-online-c/", "author": "Free Britney", "content": "Dzhokhar Tsarnaev has a growing fan base on Tumblr apparently.\nUp until last week, \"One Direction Infection\" was a Tumblr blog created and maintained by an eighth grader devoted to the British boy band heart throbs.\nNow, it's devoted to the Boston Marathon bombing suspect.\nJahar, as Dzhokhar Tsarnaev's friends and Twitter followers call him, has amassed a pretty huge following for a man charged withterrorism and WMD use.\nHe has his own hashtag, #FreeJahar, on Twitter, while thousands of Tumblr and Facebook fans closely follow his case and discuss his \"innocence.\"\nBeyond the boilerplateBoston bombing conspiracytheories that claim he's the fall guy or the whole thing is a hoax, there are other reasons for his appeal.\n\"I do believe he is very cute, but that’s not the reason I'm involved in this movement,\" the aforementioned 1D turnedFree Jahar Tumblr owner told Gawker.\n\"I am in this because I don’t believe its right to put a totally innocent person in jail for the rest of his/her life or even death penalty. I don’t care who it is, it just isn’t fair.\"\nBy any measure, #FreeJahar is a bizarre expansion of \"fandom\" culture - rabid communities of admirers, usually young women, that organize themselves online.\nExchanging photos, fan art and writing, their near-undefinable flood of emotion and desire is palpable. In this case, it can also be political and viral.\nFor the most part, #FreeJahar believers' Tumblr pages are image-heavy and mock the \"perception\" of Dzhokhar Tsarnaev as a terrorist or criminal.\nThey are conspiratorial (\"If you believe the official story regarding Boston, I don’t know what to tell you\"), yet, in the majority of cases, blatantly juvenile.\nIt's hard to tell exactly how many people believe in Tsarnaev's innocence, or how strongly. But there's no doubt that the \"movement\" is growing fast.\nOn Tumblr, there are a dozen or so dedicated #FreeJahar blogs, and scores of allies and sympathizers who \"like\" and \"reblog\" their posts loyally.\nOn Twitter, Tsarnaev's friends, many of whom have embraced #FreeJahar, have thousands of followers, while pro-Jahar Facebook pages are heavily \"Liked.\"\nIt's hard to say what possesses someone to become involved in such activity, but the Jahar loyalists aren't alone. James Holmes has online fans too.\nSeriously.", "date": "-", "id": "9351"}, {"title": "Why They’re Here and Who They Are", "url": "http://www.thedailybeast.com/articles/2013/04/19/the-chechens-in-america-why-they-re-here-and-who-they-are.html", "author": "Andrew Meier", "content": "First off—who are these young men?\nFrom what I’ve been able to gather about the Tsarnaev brothers, only one direct link to Chechnya has emerged. Anzor Tsarnaev, their father—who claims to have spoken with one of his sons the day after the Marathon attacks—lives in Makhachkala, Dagestan, a small region of the Russian Federation that borders Chechnya on the Black Sea. The father has said that his elder son, Tamerlan, now dead, visited “relatives” in Chechnya last year. (U.S. officials report that Tamerlan flew to Moscow in January, 2012, and returned to the U.S. six months later.)\nThe young men’s father is said to be an ethnic Chechen, but born and raised in Kyrgyzstan—a former Soviet republic in Central Asia. (On Red Army Day in the winter of 1944, Stalin deported hundreds of thousands Chechens from their homeland—many died, but many who survived the journey resettled in Central Asia.) The Tsarnaevs' mother, who does not have a traditional Chechen first name, is said to be from Dagestan. Tamerlan, the older brother, was reportedly born in Dagestan, while his younger brother, Dzhokhar, was born in 1993—in Kyrgyzstan. So it would seem—at this early point—that their ties to Chechnya were tenuous. It remains to be seen, if in fact Tamerlan Tsarnaev visited Chechnya last year, what he did during his time there.\n The suspects' family responds to the hunt for the two young men.\nHow big is the Chechen community in this country?\nExtremely small. There’s no official organization, no association, or even an online community, of ethnic Chechens living in the US. It cannot even be termed a “Diaspora”—I’d estimate the total at no more than 250 people. One Chechen refugee in New York tries to keep track of every Chechen in the country the refugee has met—the list runs to 81 people. They’re spread out across the country—New York, Miami, Washington, D.C., New Jersey, California, and Boston.\nEuropean nations have taken far greater numbers of refugees from Chechnya. In Austria, the Czech Republic, France, Belgium, and Germany, for instance, the number of formerly Chechen nationals ranges in the thousands, if not tens of thousands. Turkey, a country close to Chechnya, and with traditional and ethnic ties, may have the largest population: with an estimated 50,000 ethnic Chechens.\nWhy have they left their homeland?\nWar. Chechnya—a tiny region in the Caucasus that’s about the size of Connecticut—has suffered two wars in recent years. From 1994-96, in the “first” war, a charismatic (if unhinged) former Soviet air force general named Dzhokhar Dudaev sought to free his people from the Kremlin’s control and create a would-be statelet. Then in the fall of 1999, the “second” Chechen war began—dubbed Putin’s War, after the newcomer in the Kremlin, then all but unknown in the West: Vladimir Putin. Though the true death toll will never be known, human rights experts estimate the total dead—of Russians and ethnic Chechens—in the hundreds of thousands.\nBut one point bears remembering: if in the first war, the Chechen rebels were “freedom fighters” in the old Ronald Reagan/Margaret Thatcher way of seeing things, young men hungering for independence in a guerrilla war of decolonization, Putin’s War marked a sharp turn. Beginning in the fall of 1999, the Russian assault was far more brutal (more troops, even more bombs), and the Chechen response further radicalized. The talk soon turned from sovereignty to revenge, and among the young, and most militant, fighters, those with the least experience of the Soviet yoke, the rebellion carried a new name: jihad.\nAslan Akhmatov/AP\nThe talk soon turned from sovereignty to revenge, and among the young, and most militant, fighters, those with the least experience of the Soviet yoke, the rebellion carried a new name: jihad.\nRuslan Tsarni, a man claiming to be an uncle of the Tsarnaev brothers, has said that they received “asylum” in 2003. How common is that?\nVery rare. First, it is unclear if the uncle meant “political asylum,” or if he knows the legal status of their residency in this country. But if that claim proves true, it would seem an exception. Only a few ethnic Chechens—the precise number is not known—are here because they have succeeded in winning political asylum. Ilyas Ahkmadov, the former Foreign Minister (1999-2005), who fought during the first Chechen-Russian war, lives in the U.S. But even with the backing of some of Washington’s most prominent politicians, Akhmadov has had to wage a long and arduous campaign to stay.\nSome of the “Chechens” in this country are even second—and third-generation Americans—families whose roots lie in Jordan, among the Chechen Diaspora there, which formed largely after Stalin’s mass deportation of the Chechens.\nIn the aftermath of \"Putin's War\", with Moscow again firmly in control in Chechnya, have Chechen fighters turned increasingly to terrorism?\nAgain let's be clear: It remains to be established that the Tsarnaev brothers had any strong link to Chechnya—either its recent history of warfare, or to the terrorists, both native and foreign, who have sought to wage jihad in the name of Chechen independence.\nThe brothers, though, had fled a region long wracked by violence. Whether in Makhachkala or Boston, they were likely to have known its toll.\nSince 2000, Russians and Chechens have seen a succession of deadly terrorist attacks arising from the wars in the Caucasus. In June 2000, Khava Barayeva, a relative of two Chechen field commanders, blew herself up in a truck bomb at a military checkpoint in Chechnya—becoming the world's first known Chechen female suicide bomber. In May 2002, a bomb at Victory Day parade in Dagestan (where the Tsarnaevs' parents are reported to live now) killed 35 people, including 12 children. That fall came the Moscow theater siege—when 41 terrorists, including 18 women, seized a Moscow theater, holding almost 800 people hostage for three days. In the end, Russian Special Forces stormed the theater, killing all the terrorists and 130 hostages. (The hostages were killed by the gas the Russians deployed.)\nThe string of attacks that has followed is seemingly without end. But none looms larger in Russians’ memory than the siege in Beslan. On September 1, 2004, the first day of school, a group of terrorists—among them Chechens, Ingush (a neighboring ethnic group of the North Caucasus) and at least one ethnic Slav—took nearly 1,200 civilians hostage in a middle school in Beslan, North Ossetia—a region in Russia to the west of Chechnya. By the siege’s end, an estimated 1,000 civilians were killed or wounded—hundreds of them children. Putin leveled the blame at the \"intervention of international terrorists.\" But Aslan Maskhadov, the former rebel leader, and once a sober-minded negotiator with the Kremlin, spoke out from hiding to denounce the attack. The Beslan operation, Maskhadov said, was the work of \"madmen\" driven by revenge, not insurgents fighting for freedom for their homeland.\nIn the years since Beslan, few Russians speak of \"Chechen rebels\" any more, but rather of \"Chechen terrorists.\" And the long-suffering Chechens who remain in their homeland have seen it return to the Russian fold. Its capital, Grozny, once leveled to ruins that resembled Stalingrad in World War II, is now rebuilt, with gleaming banks and towering apartment buildings. But Chechnya has become a republic of fear, the fiefdom of one man: its mercurial 36-year-old president, Ramzan Kadyrov.", "date": "Fri, 19 Apr 2013 18:34:16 GMT", "id": "3180"}, {"title": "Liberal Columnist Cautions: Too Soon to Say Islamic Extremism Motivated Tsarnaev Brothers", "url": "http://newsbusters.org/blogs/howard-portnoy/2013/04/21/liberal-columnist-cautions-too-soon-say-islamic-extremism-motivated-", "author": "Howard Portnoy", "content": "In a column published Friday, Megan Garber, a staff writer at “The Atlantic” proffers some sage advice to members of the media: Stop pinning labels on people whose names end up in the headlines because of dastardly deeds. The title of piece — “The Boston Bombers Were Muslim: So?” — is meant as an admonition. And so are the opening paragraphs, which catalog all the things “we think we” know about the brothers Tsarnaev (Tamerlan was a “gifted athlete” and “very religious,” Dzhokar is “very quiet” and career-oriented).\n Although some of the descriptors she cites are well-documented (for example, “Dzhokar received a scholarship from the City of Cambridge”), she dismisses all in the third paragraph as “provisional facts,” adding:\n They are the products of the chaos of breaking news, and may well also be the products of people who stretch the truth — or break it — in order to play a role in the mayhem. They are very much subject to change. But they are also reminders of something it’s so easy to forget right now, especially for the many, many members of the media — professional and otherwise — who currently find themselves under pressure of live air or deadline: Tamerlan and Dzhokar Tsarnaev are not simply ‘the Marathon bombers,’ or ‘murderers,’ or ‘Chechens,’ or ‘immigrants,’ or ‘Muslims.’ They might turn out to be all of those things. They might not. The one thing we know for sure is that they are not only those things. They had friends and families and lives. They had YouTube accounts and Twitter feeds. They went to class. They went to work. They came home, and they left it again.\n Well, shucks, don’t we all feel like a bunch of jerks now?\n Putting aside the smarmy and misplaced sympathy, there is actually a kernel of truth to Garber’s cracker barrel psychologizing. So far no definitive link has been established between the Tsarnaevs’ religious beliefs and their deadly actions last Monday. But similar claims may be made for every other news story centering on extreme violence. Yet, that reality has not deterred writers who share Garber’s leftist persuasion from applying labels with alacrity, so long as the “villain” is a white male (or even when he is not: George Zimmerman anyone?).\n To take a recent example, right after the Newtown shootings, liberal commentators resorted not only to labels but stereotypes. David Sirota, who recently enshrined himself in the pantheon of leftist bigotry by expressing his fervent hope that the Marathon bombers would turn out to be white males, appeared on MSNBC last December to offer support for the systematic profiling of white males.\n The publication Garber writes for has been guilty of wholesale labeling, as evidenced by an article that appeared at the publication’s blog, The Atlantic Wire, in the wake of the Tuscon shootings.\n One could argue in Garber’s defense that her column is intended as a “warning to both benches.” But she tramples on that rationale by ignoring her own advice, writing:\n The problem is that there is no real place for the Boston bombings and their aftermath, just as there was no real place for Aurora or Columbine or Newtown. Their events were, in a very literal sense, outliers: They are (in the U.S., at least) out of the ordinary. They were the products of highly unusual sets of circumstances — of complexity, rather than contradictions. [Emphasis added]\n She has decided in advance of any known motive for the bombings that they were the product of lone wolves. This assumption stands in blunt contradiction to her own admissions elsewhere that the Tsarnaevs’ Islamic faith may have “motivated them in their actions on Monday.”", "date": "Sun, 21 Apr 2013 00:00:00 GMT", "id": "2943"}, {"title": "Photo of Boston cop’s act of kindness goes viral", "url": "http://news.yahoo.com/blogs/lookout/boston-police-milk-watertown-photo-124528069.html", "author": "Dylan Stableford", "content": "Police Officer John Bradley (Kevin Wells/Facebook)\nDuring Friday's intense manhunt for Dzhokhar Tsarnaev in Watertown, Mass., when the city of Boston was on lockdown, a Brookline police officer delivered milk to a family with a baby.\nAnd like many random acts of kindness seen in the wake the marathon bombings, the photo—posted to Facebook by the family—went viral, thanks in part to a tweet from the Boston Police Department:\nBPD Officer delivers milk to a family with young children in Watertown during the lockdown.\nKevin Wells, the father, took the photo of the officer, John Bradley, as he arrived carrying two gallons of milk for Holden, Wells' 17-month-old son.\nDuring the lockdown, the boy's grandmother, who was visiting from Colorado, left the house to ask the officer if he could grab some milk for the young couple.\n“It just meant the world that he literally went out and got two gallons of milk,\" McKenzie Wells, the boy's mother, told Today.com. “We wanted to pay him, but he wouldn’t take money from us. He was just so generous.\"\nThe photo has been shared more than 100,000 times.\nTsarnaev escaped capture in Watertown during a shoot-out with police that killed his brother, Tamerlan Tsarnaev, the other suspect in the marathon bombing case. A bloodied Dzhokhar was later found hiding in a boat in a Watertown backyard.", "date": "Tue, 23 Apr 2013 00:00:00 GMT", "id": "5542"}, {"title": "People From All Over Offer Plots for Tamerlan Tsarnaev Burial", "url": "http://www.bostonmagazine.com/news/blog/2013/05/07/tamerlan-tsarnaev-burial/", "author": "Steve Annear", "content": "Photo via Paul D. Keane\nUPDATE: According to Worcester Police, after nearly a week in a local funeral home, the body of accused Boston bombing suspect Tamerlan Tsarnaev has been moved, and buried in an undisclosed location.\nThe move came after more than several cemeteries, including sites in Cambridge and Boston, denied the funeral home’s requests to bury the body on their properties. “As a result of our public appeal for help, a courageous and compassionate individual came forward to provide the assistance needed to properly bury the deceased. His body is no longer in the City of Worcester and is now entombed,” according to a statement from the police department.\nThe Police Chief thanked “all of the officers who worked the security detail at the funeral home” and acknowledged their professionalism and dedication. He also thanked the funeral director who took on the daunting task, which spurred outrage on the streets outside his business, of finding a place to put the body to rest at the request of the family.\n—\nEARLIER: Clerics from as far as Colorado have offered to put an end to a nearly week-long stalemate over what to do with the remains of Boston Marathon bombing suspect Tamerlan Tsarnaev.\nAccording to CBS News, Sheikh Abu-Omar Almubarac, a founding member of an organization that helped build Colorado’s largest mosque, has offered an unmarked plot in the Denver area to Tsarnaev’s family so that they can hold a funeral for the accused bomber. He told the news originization that it would be up to the family to cover the cost of transporting the body if they were to welcome the offer, however.\nIn Connecticut, Paul D. Keane blogged about giving up a burial plot he purchased for his family, next to his mother’s grave, in the Mt. Carmel Burying Ground, to the Tsarnaev family. Keane wrote on his blog this week about the conditions for offering up the burial space:\nThe only condition is that I do it in memory of my mother who taught Sunday School at the Mt. Carmel Congregational Church for twenty years and taught me to “love thine enemy.”\nAnother anonymous man from Texas also offered a space for the deceased, according to Stefan, but the offer later fell through.\nThe offers started coming in after more than three cemeteries in Massachusetts told Peter Stefan, funeral director at the Graham Putnam and Mahoney Funeral Parlor in Worcester, where Tsarnaev’s body is, that they would not allow the suspect to be put to rest in their graveyards.\nFamily members have asked that the body be put in a grave in Cambridge, but the City Manager Bob Healy denied the request before Stefan even filed for a permit to do so. “The difficult and stressful efforts of the citizens of the city of Cambridge to return to a peaceful life would be adversely impacted by the turmoil, protests, and wide spread media presence at such an interment,” Healy said Sunday.\nStefan fielded more than 1,500 calls form around the world over the weekend, in regards to Tamerlan’s remains, but has since stopped returning calls to the press, according to an employee at the Worcester funeral home.\nStefan originally planned to have the issue squared away by Tuesday, asking that if he couldn’t find a plot that federal officials or the governor step in. Governor Deval Patrick refused to intervene, telling reporters on Monday that it is the families issue, not the state’s. “The family has options, and I assume that they will exercise one of those options, and I hope they do so soon,” Patrick said on his way out of his office Monday, according to the State House News Service.\nStefan says Tamerlan’s mother wants the body returned to Russia, where the family lives, which might be their last option—something even Mayor Tom Menino would like to see happen.", "date": "Tue, 7 May 2013 16:54:57 GMT", "id": "8430"}, {"title": "Tamerlan Tsarnaev called wife before shootout", "url": "http://www.gopusa.com/news/2013/05/03/tamerlan-tsarnaev-called-wife-before-shootout/", "author": "USA Today", "content": "The suspects in the Boston Marathon double bombing had originally planned to strike on July 4, but chose the race because it coincided with the time they had finished assembling their explosives, law enforcement officials said Thursday.\nAccording to hospital interviews with surviving suspect Dzhokhar Tsarnaev shortly after he was captured, the suspects apparently finished constructing the explosives well before they had originally planned and chose to act sooner rather than wait, said one of the officials, who was not authorized to speak publicly on the matter.\nIt was not immediately clear, however, whether the suspects had identified a specific July 4 target, the official said. Boston hosts one of the premiere July 4 celebrations in the U.S., featuring the Boston Pops and a spectacular fireworks display on the banks of the Charles River.\nThe suspects allegedly settled on the marathon after noticing preparations for the race shortly before the event.\nTsarnaev has been charged with detonating one of the pressure-cooker devices; his brother Tamerlan Tsarnaev was killed in a confrontation with police in the days after the attacks.\nMeanwhile, investigators want to find out what Tamerlan Tsarnaev and his wife, Katherine Russell, discussed when he phoned her a few hours after the FBI released photos of him and his brother as suspects in the deadly attack.\nTamerlan Tsarnaev, 26, died not long after the April 18 conversation during a shootout with police that left Dzhokhar, 19, seriously injured.\nDzhokhar Tsarnaev was captured a few hours later hiding in a boat in a backyard in Watertown, Mass. He is being held at a prison medical center.\nA spokesman for Russell's attorney, Amato DeLuca, did not respond directly to questions about Russell's telephone contact with Tsarnaev. Instead, he referred to a written statement DeLuca issued earlier that said Russell \"will continue to meet with law enforcement, as she has done for many hours over the past week, and provide as much assistance ... as she can.\"\nFederal investigators took a DNA sample from Russell as part of the inquiry that also involves analysis of remains of a pressure-cooker device detonated at the race finish line.\nOn the same evening that Tamerlan and Russell spoke by telephone, federal prosecutors now allege that three classmates of Dzhokhar Tsarnaev at the University of Massachusetts-Dartmouth concluded that he was one of the suspects after seeing the photographs circulated by the FBI. The three, charged Wednesday with impeding the investigation, allegedly went to his dorm room and removed his backpack containing fireworks stripped of gunpowder and a laptop. Gunpowder was among the main components in the bombs.\nA federal complaint charges that they took the items to try to keep their friend from getting into trouble. The backpack was recovered at a Boston-area landfill. The laptop has since been turned over to authorities.\nAuthorities do not believe the students knew about the attack plan or helped carry it out.\n---\nRating: 7.4/10 (13 votes cast)", "date": "Thu, 4 Jul 2013 12:00:00 GMT", "id": "7511"}, {"title": "FBI Tipped Boston Bombing Suspect Was Radical Islam Follower in 2011", "url": "http://washington.cbslocal.com/2013/04/20/fbi-tipped-boston-bombing-suspect-was-radical-islam-follower-in-2011/", "author": "-", "content": "A foreign government told the FBI in early 2011 about information that Tamerlan Tsarnaev, one of the brothers suspected in the Boston Marathon bombings, was a follower of radical Islam.\nTamerlan Tsarnaev died in a shootout, and his younger brother was captured alive. They were identified by authorities and relatives as ethnic Chechens from southern Russia who had been in the U.S. for about a decade.\nAccording to FBI, the foreign government said that based on its information, Tamerlan Tsarnaev was a strong believer and that he had changed drastically since 2010 as he prepared to leave the U.S. for travel to the country’s region to join unspecified underground groups.\nThe FBI says it interviewed Tsarnaev and relatives, and did not find any domestic or foreign terrorism activity.\nRuslan Tsarni, an uncle of the suspected bomber who lives in Maryland, says he grew concerned about Tamerlan Tsarnaev when he told him in a 2009 phone conversation that he had chosen “God’s business” over work or school. Tsarni said he then contacted a family friend who told him Tsarnaev had been influenced by a recent convert to Islam.\nTsarni also referred to the elder Tamerlan as a “loser” during an interview with WBZ-TV in Boston.\nFollow WNEW on Twitter.\n(TM and Copyright 2013 CBS Radio Inc. and its relevant subsidiaries. CBS RADIO and EYE Logo TM and Copyright 2013 CBS Broadcasting Inc. Used under license. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.)", "date": "Sat, 20 Apr 2013 13:46:08 GMT", "id": "4421"}]